// 
// Quest ID:17681
// [凱梅爾茲共和國] 最終報告


npc.sayNextE("你來了啊，#h0#。我正在等你。", 1540450);
npc.sayNextE("您好，女皇大人，我剛剛回來。", true);
npc.sayNextE("再次見到你，我很高興。你這段時間過得如何？其實之前有段時間沒能聯絡上你，我還擔心來著。", 1540450);
npc.sayNextE("是的，發生了很多事情。雖然我在那裡結交了新的朋友，但是我也被捲入了很多複雜的事件中，發生了一些讓人頭疼的事情。", true);
npc.sayNextE("真是辛苦你了。那麼，凱梅爾茲實際上是個怎樣的地方？", 1540450);
npc.sayNextE("嗯，那裡比我想象中要更加充滿活力。綠色大自然和涼爽的風……秀麗的風景……在那裡生活的許多人……還有他們專屬的許多事情……", true);
npc.sayNextE("真是個美麗的地方啊，我以後也想去一次呢。", 1540450);
npc.sayNextE("啊，這是凱梅爾茲共和國首領大人的親筆信。他讓我交給女皇大人。", true);
npc.sayNextE("#face0#給我嗎？", 1540450);
npc.sayNextE("是的，因為這是給女皇大人的信，所以我不知道里面的內容，但我想這應該是為了和平的信件。", true);
npc.sayNextE("原來如此，真是辛苦你了。看來我把這件事委託給#h0#真是太正確了。這個成果將幫助凱梅爾茲共和國和整個冒險島世界。這都是#h0#的功勞。", 1540450);
npc.sayNextE("您過獎了。", true);
npc.sayNextE("這次你也沒有辜負我的期待，真的謝謝你。#h0#，你的存在一直都是我的巨大支柱。", 1540450);
npc.sayNextE("#face2#之前發生了那麼多辛苦的事情，請你好好休息吧……到我再次需要#h0#的幫助之前哦，呵呵。", 1540450);
npc.sayNextE("對了，我為#h0#準備了小禮物。請你去找南哈特吧。", 1540450);
npc.startQuest();