// 
// Quest ID:17642
// [凱梅爾茲共和國] 改變主意的男人


npc.sayNextE("啊..對不起。我太輕率了。我應該先和你商量一下的。", true);
npc.sayNextE("那樣才對。雖然我們是朋友,但是我現在的身份是這艘船的船長啊。任何小事都應該先向我報告...");
npc.sayNextE("哎呀,這船怎麼造的這麼沒品味啊?是為了控制在便宜的價格範圍內嗎。", 9390204);
npc.sayNextE("!!!!!!!!!!!!!!!!!!");
npc.sayNextE("聽你一說我覺得萊文你說得對。雖然是朋友關係也該公私分明。我好好跟她說讓她下船,你就別操心了。", true);
npc.sayNextE("喂。我有話跟你說。", true);
npc.sayNextE("嗯?什麼事?你應該不會是要我做這低賤的船務吧?", 9390204);
npc.sayNextE("不,那倒不是的。其實是想對你說抱歉..", true);
npc.sayNextE("雖然是抱歉的話,但是今後也許會發生一些危險的事情。關於這點希望你能理解。");
npc.sayNextE("我以為你要說什麼呢。那個我早就想到了。我要是被抓了一定不會麻煩你來救我的,你就別擔心我了,擔心擔心那邊吧。如果沒別的事我就失陪了。", 9390204);
npc.sayNextE("萊文怎麼說的？你讓她下船也行。和我也沒什麼深交，不過是比你多見過一次罷了。", true);
npc.sayNextE("喔呵呵。船已經離港,想下船都難嘍。讓女孩一箇人回去也不安全。反正不管怎樣你知道那麼回事就行了。");
npc.sayNextE("(不管怎麼說,好像瞭解了又貌似完全不瞭解的傢伙。變來變去的。)", true);
npc.completeQuest();
player.gainExp(953667);