/*     
 *  
 *  功能：[啾啾島]尋找天宇鯨山之味&amp;lt;1&gt;
 *  

 */

npc.sayNextS("嗯... #b嗶嘟？#k你想做什麼肉餅啊...", false);
npc.sayNext("蛋...蛋...蛋...蛋", 3003164);
npc.sayNextS("你要說出來我才能知道~ 你說什麼？", false);
npc.sayNext("我不是說了我要吃#b蛋#k嗎？\r\n希望你能認真點聽我說話。", 3003164);
npc.sayNextS("哦？原來你會好好說話的啊？", false);
npc.sayNext("呵呵~我…不太會…說話…哼哼...\r\n如果…放上用蛋做成的餅....應該很好吃，呵呵", 3003164);
npc.sayNextS("搞什麼啊..這傢伙...", false);
npc.sayNext("呵呵~ 請去狩獵#b天宇鯨山#k的#b大猩鴉#k和#b大猩鴉族長#k，蒐集#i4034954:##z4034954:##i4034955:##z4034955:#…#k它們可以當作…調料…還可以用來孵化…我擁有的蛋...？", 3003164);
npc.sayNextS("用羽毛…作為調料.... 嗯，我現在都不覺得奇怪了…我去去就會！", false);
npc.say("快去快回，呵呵，轉轉轉！", 3003164);
npc.startQuest();