/*
let sel = npc.askMenu("<Boss：風雨森林>\r\n\r\n偉大的勇士啊。做好迎戰黑魔法師的邪惡軍團的準備了嗎？\r\n\r\n#b通關可隨機獲得\r\n\r\n#e#v1102623##v1072870##v1152160##v1032224##v1132247##v1012438##v1122269##v1003976##v1052669##v1082556##v1022211##v1342090##v1353606##v1353306##v1353505##v1353205##v1353405##v1552084##v1352807##v1353105##v1342095##v1352206##v2613064##v2613065##v2612077##v2612076##v2616075##v2616074##v2614067##v2614005##v2614060##v2434780##v2434779##v2434778##v2434777##v2434776##v2434775##v4001785##v4001714##l#n\r\n"+
                    "#L1##b隊長點擊申請進入#r<boss：風雨森林入口>#l#n\r\n\r\n");
switch (sel) {

           case 1:
            
            player.runScript("new_風雨森林入口");
            break;
			


}    
*/