var selectedItem = -1;
var selectedCost = -1;
var reward = [Array(1, 4033191, 10, "可在活動商店兌換獎勵"),
    Array(2, 4033191, 8, "可在活動商店兌換獎勵"),
    Array(3, 4033191, 6, "可在活動商店兌換獎勵"),
    Array(4, 4033191, 5, "可在活動商店兌換獎勵"),
    Array(5, 4033191, 5, "可在活動商店兌換獎勵"),
    Array(6, 4033191, 5, "可在活動商店兌換獎勵"),
    Array(7, 4033191, 4, "可在活動商店兌換獎勵"),
    Array(8, 4033191, 4, "可在活動商店兌換獎勵"),
    Array(9, 4033191, 4, "可在活動商店兌換獎勵"),
    Array(10, 4033191, 4, "可在活動商店兌換獎勵"),
    Array(11, 4033191, 3, "可在活動商店兌換獎勵"),
    Array(12, 4033191, 3, "可在活動商店兌換獎勵"),
    Array(13, 4033191, 3, "可在活動商店兌換獎勵"),
    Array(14, 4033191, 3, "可在活動商店兌換獎勵"),
    Array(15, 4033191, 3, "可在活動商店兌換獎勵"),
    Array(16, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(17, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(18, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(19, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(20, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(21, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(22, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(23, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(24, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(25, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(26, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(27, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(28, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(29, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(30, 4033191, 2, "可在活動商店兌換獎勵"),
    Array(31, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(32, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(33, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(34, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(35, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(36, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(37, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(38, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(39, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(40, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(41, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(42, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(43, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(44, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(45, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(46, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(47, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(48, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(49, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(50, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(51, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(52, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(53, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(54, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(55, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(56, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(57, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(58, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(59, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(60, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(61, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(62, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(63, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(64, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(65, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(66, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(67, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(68, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(69, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(70, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(71, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(72, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(73, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(74, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(75, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(76, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(77, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(78, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(79, 4033191, 1, "可在活動商店兌換獎勵"),
    Array(80, 4033191, 1, "可在活動商店兌換獎勵")]

if (map.getId() == 706051000) {
    player.changeMap(993016000);

    if (!player.hasItem(4032472, 100)) {
        npc.say("您非正常透過，無法獲得獎勵！");
    } else {
        player.loseItem(4032472, 100);
        //查詢當前最大的值
        var sql = "SELECT MAX(RANK) AS RANK FROM jili_game WHERE gametype = 1";
        var push = player.customSqlResult(sql);
        var rank = 0;
        if (push.size() > 0) {
            var result = push.get(0);
            rank = result.get("rank");
        }
        rank++;
        //查重
        var sql = "SELECT name FROM jili_game WHERE gametype = 1 AND name = '" + player.getName() + "'";
        var push = player.customSqlResult(sql);
        if (push.size() > 0) {
            npc.say("您已經領取過一次了，無法重複提交");
        } else {
            player.customSqlInsert("INSERT INTO `jili_game` (`name`,`rank`,`gametype`) VALUES ('" + player.getName() + "'," + rank + ",1)");
            npc.broadcastPlayerNotice(13, "【跑酷達人】" + " : 玩家 " + player.getName() + " 在本次活動中獲得第 " + rank + " 名！");
            var str = "恭喜您！您獲得本次#b跑酷達人#k第#r " + rank + "#k 名\r\n您獲得了獎勵:\r\n";
            for (var i = 0; i < reward.length; i++) {
                if (rank == reward[i][0]) {
                    str += "#v" + reward[i][1] + "# x " + reward[i][2] + " " + reward[i][3] + "\r\n"
                    player.gainItem(reward[i][1], reward[i][2]);
                } else {

                }
            }
            npc.say(str);
        }

    }

}

 