let boxId = 2438503;//箱子ID
let items = [
Array(1113096, 1, "全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10),//狐狸戒指
];
if (player.getInventorySlot(1, 1)!=null){
equip = player.getInventorySlot(1, 1);
}else{
npc.say("#fs14##b裝備欄第一格位置是空的！");
}
if (equip.getDataId() == items[0][0] && player.hasItem(boxId,1)){
    player.loseInvSlot(1, 1);
	player.loseItem(boxId,1);
		for (var i = 0; i < items.length; i++) {
			if (items[i][3] > 0) {
				let newItem = player.makeItemWithId(items[i][0]);
				//player.gainItem(items[i][0], items[i][1]);
				newItem.setStr(items[i][3]);
				newItem.setDex(items[i][4]);
				newItem.setInt(items[i][5]);
				newItem.setLuk(items[i][6]);
				newItem.setMaxHp(items[i][7]);
				newItem.setPad(items[i][8]);
				newItem.setMad(items[i][9]);
				newItem.setBossDamageR(items[i][10]);
				newItem.setIgnorePDR(items[i][11]);
				newItem.setDamR(items[i][12]);
				player.gainItem(newItem);
			} else {
				player.gainItem(items[i][0], items[i][1]);
			}
			//player.gainItem(items[i][0], items[i][1]);
		}
} else {
npc.say("#fs14##b請在裝備欄第一格位置放上正確的裝備！");
}

/*
累計儲值
Array(1113096, 1, "全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10),//狐狸戒指
Array(1114400, 1,"全屬+200、物&魔攻+200",200,200,200,200,0,200,200,0,0,0), //燃燒戒指
Array(1190538, 1,"全屬+150、物&魔攻+150、20%B傷、20%無視、20%總傷",150,150,150,150,0,100,100,20,20,20), //五個碎片橘子能源
Array(1122267, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //頂級培羅德項鍊
Array(1113075, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //頂級培羅德戒指
Array(1032223, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //頂級培羅德耳環
Array(1132246, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //頂級培羅德腰帶
Array(1182158, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //黑翼勳章
Array(1012632, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //口紅控制器
Array(2432122, 1,"自選魔導書,全屬+150、10%B傷、10%無視、10%總傷"), //自選魔導書
Array(1113220, 1,"全屬+300、物&魔攻+300",300,300,300,300,0,300,300,0,0,0), //幽暗戒指
Array(1022278, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //附有魔力的眼罩
Array(1113306, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), 
Array(1114402, 1,"全屬+300、物&魔攻+300",300,300,300,300,0,300,300,0,0,0), //艾爾達斯的祝福戒指
Array(1122430, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //苦痛的根源
Array(1202160, 1,"全屬+300、物&魔攻+300",300,300,300,300,0,300,300,0,0,0), //小筱圖騰
Array(1113211, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //天上的氣息
Array(1672075, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //M-DAY心臟
Array(1113306, 1,"全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10), //巨大的恐怖

第一期
Array(1672069, 1, "全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10),//女武神之心
第三期
Array(1113196, 1, "全屬+150、物&魔攻+150、10%B傷、10%無視、10%總傷",150,150,150,150,0,150,150,10,10,10),//強力的魔性
第四期
Array(1182285, 1, "全屬+200、物&魔攻+200、20%B傷、20%無視、20%總傷",200,200,200,200,0,200,200,20,20,20),//創世胸章
Array(1132308, 1, "全屬+200、物&魔攻+200、25%B傷、25%無視、25%總傷",200,200,200,200,0,200,200,25,25,25),//夢幻腰帶
*/