

let mapA = map.getId();
if (mapA == 993001100) { //限制開啟地圖
	//player.showSystemMessage("在卡BUG頭蓋骨給你打出來 操!!");
} else {


	text = "#e#fs18##v2633238##r#z2633238#:\r\n#n";
	text += "#fs15##b";
	text += "隨機獲得某類跑環材料*200個\r\n";

	text += "#e#d#fs16##L0#點我領取#l";
}
let sel = npc.askMenu("" + text, true);
if (sel >= 0) {
	if (player.getFreeSlots(2) < 3 || player.getFreeSlots(5) < 5 || player.getFreeSlots(3) < 5) {
		npc.say("#fs18##b#e消耗欄位及其他欄位及特殊欄位不足。");
	} else {
		var items = Array(4000000, 4000001, 4000014, 4000034, 4000048, 4000331, 4000296, 4000297, 4000269, 4000268, 4000270, 4000002, 4000011, 4000622, 4000028, 4000242, 4000051, 4000595, 4000596, 4000597, 4000598, 4000601, 4000602, 4000156, 4000155, 4000167, 4000106, 4000073, 4000232, 4000233, 4000234, 4000238, 4000050, 4000060, 4000083, 4000106, 4000107, 4000277, 4000295, 4000328, 4000325, 4000236, 4000447, 4000068, 4000023, 4000334, 4000360, 4000115, 4000112, 4000069, 4000330, 4000110, 4000099);
		DROPSITEM = Math.floor(Math.random() * items.length);

		player.gainItem(items[DROPSITEM], 200),//
			player.loseItem(2633238, 1);

	}
}

