/**
 *
 *
 */
let event = reactor.getEvent("boss_beidler");
// if (null != event && event.getVariable("dropItems") == "0") {
//     event.setVariable("dropItems", "1");
    reactor.dropItemsOld(0, 0, 0,
        4310097, 1000000,//貝勒德幣
        4310097, 1000000,//貝勒德幣

        //2614005, 1000000,//100萬突破
        //2614005, 1000000,//100萬突破
        //2614005, 1000000,//100萬突破
        //2614005, 1000000,//100萬突破
        2614005, 1000000, //100萬突破
        2614005, 1000000, //100萬突破

        4021029, 1000000,//靈魂的精髓	

        4001714, 1000000,//100萬金幣
        //4310098, 500000,//低階貝幣
        1113074, 23000,//高階貝勒地戒指		
        1113075, 5000,//最高階貝勒地
        1032223, 6000,//最高階貝勒地
        1122267, 7000,//最高階貝勒地
        1132246, 8000 //最高階貝勒地
    );
// }