status = -1;
//51121006 靈魂之怒 最終傷害提高30% 最終傷害+30%
//1311015  交叉鎖鏈 最終傷害提高20% 最終傷害+20%
//65121004 靈魂凝視 暴擊傷害+45%
//5320008  超級猴子魔法  力敏智運提高 60%
//15121005 急速領域 攻擊速度+2
//11101022 月光灑落 攻擊段數*2 暴擊幾率+20% 攻擊傷害降低40%
//5321054  散彈炮   攻擊段數*3 攻擊傷害降低55%
//22001012 魔法盾   受到的傷害降低85% 降低部分由MP替代
//4201011  金錢盾   受到的傷害降低50% 降低部分由金幣替代
//61121009 水盾     傷害降低30%
//31211003 驅邪     傷害降低30%
//61121009 強健護甲 傷害降低30%
//21101005 生命吸收 每次攻擊吸取生命值上限1%的HP
//31211004 惡魔恢覆 最大生命值增加25% 每4秒恢覆5%生命值 
//400011066 鋼鐵之軀  不會被擊退和擊飛
//5821009 極速領域	消耗魔量，在一定時間內使全體隊員的攻擊速度提高2級。
var skill = Array(
	Array("禦劍騎士",15112,21101005, 22001012),
	Array("沖鋒隊長", 512, 11101022, 22001012),
	Array("隱月", 2512, 11101022, 22001012),
	Array("聖晶", 15212, 11101022, 22001012), 
	Array("龍神", 2217, 5321054), 
	Array("英雄", 112, 22001012,5321054), 
	Array("戰神", 2112, 5321054, 22001012),
	Array("主教", 232,  11101022),
	Array("俠盜", 422, 11101022, 22001012),
	Array("喚靈法師", 3212, 5321054, 22001012),
	Array("劍豪", 4112, 11101022, 22001012),
	Array("超能力", 14212, 5321054, 22001012),
	Array("龍的傳人", 572, 22001012,5321054),
	Array("箭神", 322, 5321054, 22001012),
	Array("船長", 522, 5321054, 22001012),
	Array("神射手", 312, 22001012,11101022),
	Array("夜光法師", 2712, 11101022, 1311015),
	Array("尖兵", 3612, 22001012,5321054),
	Array("聖騎士", 122, 22001012,11101022),
	Array("火炮", 532, 22001012),
	Array("幻影", 2412, 22001012,5321054),
	Array("機械師", 3512, 5321054),
	Array("惡魔紅毛", 3122, 11101022, 22001012),
	Array("影魂異人", 15512, 11101022, 22001012),
	Array("奇襲者", 1512, 22001012, 11101022),
	Array("魔鏈", 6412, 11101022, 22001012),
	Array("爆莉萌天使", 6512, 22001012, 11101022),
	Array("冰雷魔導士", 222, 1311015,5321054),
	Array("暗影雙刀", 434, 11101022, 22001012),
	Array("惡魔覆仇者", 3112, 11101022),
	Array("夜行者", 1412, 11101022, 22001012),
	Array("隱士", 412, 22001012), //11101022
	Array("爆破手", 3712, 5321054, 22001012),
	Array("風靈使者", 1312, 22001012,5321054),
	Array("豹弩遊俠", 3312, 5321054, 22001012),
	Array("陰陽", 4212, 11101022, 22001012),
	Array("狂龍", 6112, 22001012,11101022),
	Array("魂騎士", 1112, 22001012,5321054),
	Array("炎術士", 1212, 5321054),
	Array("古跡獵人", 332, 5321054, 22001012),
	Array("黑騎士", 132, 11101022),
	Array("雙弩", 2312, 22001012,11101022),
	Array("虎影", 16412, 5321054, 22001012),
	Array("林之靈", 11212, 11101022, 22001012)
);

var job = player.getJob();
var name = "";
var id = "";
if(map.getId() == 104000000) {
	npc.say("不能在市場開啟BUFF");

} else {
	for(var i = 0; i < skill.length; i++) {
		if(job == skill[i][1]) {
			//職業匹配上了
			//使用BUFF
			name = skill[i][0];
			for(var j = 2; j < skill[i].length; j++) {
				player.useSkillEffect(skill[i][j], 30);
				id += "#s" + skill[i][j] + "#";
			}

		}
	}
	//10310
	if(player.getPQLog("秘籍") < 1) {
		npc.say("你的職業是：#r" + name + " #k \r\n你獲得了你的職業專屬BUFF:" + id + "\r\n讓你在床上更強大了~\r\n");
		player.addPQLog("秘籍");
	}
}