
通用模板();
function 通用模板() {
    var ItemList1 = Array(
        1012632,
        1022278,
        1032223,//最高級貝勒德耳環
        1113055,
        1113074,
        1113075,
        1113211,
        1122267,//最高級貝勒德刻印吊墜
        1132246,//最高級貝勒德刻印腰帶
        1004426,//AS
        1052890,
        1073035,
        1082640,
        1152179,
        1102797,
        1004424,
        1052888,
        1073033,
        1082638,
        1152177,
        1102795,
        1004425,
        1052889,
        1073034,
        1082639,
        1152178,
        1102796,
        1004423,
        1052887,
        1073032,
        1082637,
        1152176,
        1102794,
        1004422,
        1052882,
        1073030,
        1082636,
        1152174,
        1102775,
        1004808,//神秘
        1053063,
        1073158,
        1082695,
        1102940,
        1152196,
        1004810,
        1053065,
        1073160,
        1082697,
        1102942,
        1152198,
        1004811,
        1053066,
        1073161,
        1082698,
        1102943,
        1152199,
        1004809,
        1053064,
        1073159,
        1082696,
        1102941,
        1152197,
        1004812,
        1053067,
        1073162,
        1082699,
        1102944,
        1152200,
        1302343,//武器
        1272017,
        1282017,
        1312203,
        1322255,
        1402259,
        1412181,
        1422189,
        1432218,
        1442274,
        1582023,
        1542117,
        1232113,
        1452257,
        1462243,
        1522143,
        1472265,
        1332279,
        1362140,
        1342104,
        1252098,
        1262039,
        1372228,
        1382265,
        1552119,
        1212120,
        1222113,
        1242121,
        1482221,
        1492235,
        1532150,
        1222113,
        1242121,
        1482221,
        1492235,
        1532150,
        1212115,  //埃蘇萊布斯雙頭杖
        1272016,
        1282016,
        1222109,  //埃蘇萊布斯靈魂手銃
        1232109,  //埃蘇萊布斯亡命劍
        1402251,  //埃蘇萊布斯寬大刀
        1242116,  //埃蘇萊布斯能量劍
        1262017,  //埃蘇萊布斯ESP限制器
        1302333,  //埃蘇萊布斯軍刀
        1312199,  //埃蘇萊布斯戰斧
        1322250,  //埃蘇萊布斯戰錘
        1332274,  //埃蘇萊布斯屠龍斬
        1342101,  //埃蘇萊布斯之刃
        1362135,  //埃蘇萊布斯折疊手杖
        1372222,  //埃蘇萊布斯短杖
        1382259,  //埃蘇萊布斯長杖
        1412177,  //埃蘇萊布斯大斧
        1422184,  //埃蘇萊布斯大錘
        1432214,  //埃蘇萊布斯穿透矛
        1442268,  //埃蘇萊布斯巨靈開山斧
        1452252,  //埃蘇萊布斯弓
        1462239,  //埃蘇萊布斯弩
        1472261,  //埃蘇萊布斯復仇斗拳
        1482216,  //埃蘇萊布斯拳甲
        1492231,  //
        1522138,  //
        1532144,  //
        1552110,  //
        1252093,  //
        1542108,
        1362102,
        1282029,
        1272029,
        1402211,
        1322216,
        1532110,
        1242081,
        1482180,
        1342086,
        1442235,
        1542068,
        1312166,
        1462205,
        1092113,
        1212080,
        1332239,
        1492191,
        1372189,
        1422153,
        1262030,
        1232075,
        1412148,
        1432179,
        1452217,
        1222075,
        1382223,
        1522106,
        1552068,
        1472227,
        1582026,
        1252066,
        1302290,
        1282028,
        1272028,
        1212089,
        1222084,
        1242090,
        1232084,
        1302297,
        1312173,
        1322223,
        1332247,
        1342090,
        1362109,
        1372195,
        1382231,
        1402220,
        1412152,
        1422158,
        1432187,
        1442242,
        1452226,
        1462213,
        1472235,
        1482189,
        1492199,
        1522113,
        1532118,
        1252033,
        1542072,
        1552072,
        1422158,
        1582025,
        1262029,
        1272015,
        1282015,
        1532098,  //法弗納榮耀炮 - (無描述)
        1522094, //法弗納雙風翼弩 - (無描述)
        1492179,   //法弗納左輪槍 - (無描述)
        1482168,   //法弗納巨狼之爪 - (無描述)
        1472214,  //法弗納危險之手 - (無描述)
        1462193,  //法弗納風翼弩 - (無描述)
        1452205,   //法弗納追風者 - (無描述)
        1442223,   //法弗納半月寬刃斧 - (無描述)
        1432167,   //法弗納貫雷槍 - (無描述)
        1422140,  //法弗納閃電錘 - (無描述)
        1412135,   //法弗納戰鬥切肉斧 - (無描述)
        1402196,   //法弗納懺悔之劍 - (無描述)
        1382208,   //法弗納魔冠之杖 - (無描述)
        1372177,   //法弗納魔力奪取者 - (無描述)
        1362090,  //法弗納洞察手杖 - (無描述)
        1342082,   //法弗納急速之刃 - (無描述)
        1332225,   //法弗納大馬士革劍 - (無描述)
        1322203,   //法弗納戈耳迪錘 - (無描述)
        1312153,   //法弗納雙刃切肉斧 - (無描述)
        1302275,   //法弗納銀槲之劍 - (無描述)
        1242061,   //法弗納精神之刃 - 魯塔比斯套裝(海盜)專用武器
        1242060,   //法弗納精神之刃 - 魯塔比斯套裝(飛俠)專用武器
        1232057,   //法弗納死亡使者 - (無描述)
        1542063,   //法弗納皇刀正宗 - (無描述)
        1552063,   //法弗納煌扇藍姬 - (無描述)
        1222058,   //法弗納天使手銃 - (無描述)
        1212063,    //法弗納魔力源泉杖 - (無描述)
        1252015,
        1262016,
        1582016,
        1003797,
        1042254,//FFN防具
        1062165,
        1003798,
        1042255,
        1062166,
        1003799,
        1042256,
        1062167,
        1003800,
        1042257,
        1062168,
        1003801,
        1042258,
        1062169,
        1113056,//超越證明戒指	 
        !1122259取消,//超越證明吊墜	 
        1032201,//超越證明耳環	 
        1022195,//超越證明眼飾	 
        1012414,//超越證明臉飾	
        1122296,//死神
        1402180,
        1003722,
        1382235,
        1672069	//女武神之心

    );


    var avail = "";
    avail += "#d1、此處為25X裝備強化功能\r\n";
    avail += "2、強化需要#i4031016#，20星的指定道具才可強化#k\r\n";
    avail += "3、20-25星增加屬性為55四維，95攻擊\r\n#k";
    avail += "4、目前為最高貝勒德飾品系列/天堂戒指/超越飾品系列/巨匠死神/漆黑女武神/FFN系列套/AS系列套/神秘系列套/阿麗莎以及大刀\r\n#k";
    avail += "5、把要強化的裝備放在裝備欄的第1個位置！\r\n#k";
    avail += " #L0##b強化！#l#k\r\n#k";
    var wenzi1 = npc.askMenu("#b這裡是強化中心:\r\n\r\n#k" + avail);
    var ii = player.getInventorySlot(1, 1);
    selection = wenzi1;
    if (selection == 0) {
        var itemList = ItemList1;
        var Str = 55;
        var Dex = 55;
        var Luk = 55;
        var Int = 55;
        var all = 95;
        var Item = 4031016;
    } else {
        var itemList = 0;
    }
    if (itemList == 0) {
        npc.say("出錯咯,聯系管理員");
    } else if (!player.hasItem(Item, 1)) {
        npc.say("你並沒有#z" + Item + "#1個，所以不能開啟");
    } else if (player.getInventorySlot(1, 1) == null) {
        npc.askMenuS("請在裝備欄第一個位置放上裝備！");


    } else if (ii.getCraft() > 49) {
        npc.say("該道具已經提升/強化過了!");

    } else if (ii.getCHUC() < 20) {
        npc.say("該道具強化不足20星!");

    } else if (ii.getCHUC() > 20) {
        npc.say("該道具強化超過了20星！");

    } else if (ii.getSpecialAttribute() > 0) {
        npc.say("痕跡走開");



    } else {
        var itemid = player.getInventorySlot(1, 1).getDataId();
        var PD = false;
        for (var i = 0; i < itemList.length; i++) {
            if (itemid == itemList[i]) {
                PD = true;
                break;
            }
        }
        if (PD) {
            if (player.canGainItem(itemid, 1)) {
                var toDrop = player.getInventorySlot(1, 1);

                toDrop.setStr(toDrop.getStr() + 55); //裝備力量
                toDrop.setDex(toDrop.getDex() + 55); //裝備敏捷
                toDrop.setInt(toDrop.getInt() + 55); //裝備智力
                toDrop.setLuk(toDrop.getLuk() + 55); //裝備運氣
                toDrop.setPad(toDrop.getPad() + 95);
                toDrop.setMad(toDrop.getMad() + 95);
                toDrop.setCHUC(25);
                //toDrop.setDurability(toDrop.getDurability() + 50);
                toDrop.setCraft(toDrop.getCraft() + 50);

                //toDrop.setCuttable(1);
                //toDrop.setAttribute(16);
                player.updateItem(1, toDrop);
                player.loseItem(Item, 1);
                npc.broadcastNoticeWithoutPrefix("" + player.getName() + " ：我從強化中心強化了25星的" + player.makeItemWithId(itemid).getItemName() + ",大家一起恭喜我吧!");
                npc.say("恭喜您，已經強化了#b#z" + itemid + "#");
            } else {
                npc.say("請檢查背包有沒有位置，或者是天堂/黑龍戒指等固有道具");
            }
        } else {
            npc.say("請檢查裝備欄第一個位置是否為可解鎖物品！天堂/黑龍戒指等固有道具不可強化");
        }
    }


}


function isCashItem(itemid) {
    return player.makeItemWithId(itemid).getSn() > -1;
}
