var status = -1
var txt;
/*------------------------------------------------------------*/
var a30 = "#fEffect/CharacterEff/1022223/6/0#" //跑马灯
var a31 = "#fEffect/CharacterEff/1022223/7/0#" //跑马灯
var a32 = "#fEffect/CharacterEff/1022223/8/0#" //跑马灯
var a38 = "#fItem/Pet/5000213.img/stand0/0#";//藍色惡魔
var items = Array(

    Array(5192000, 9999999, 1, "楓點商店-實用雜物專區[寵物強化箱]"),
    Array(2435122, 6000, 1, "楓點商店-實用雜物專區[傷害字型儲存欄位 1欄擴充券]"),
    Array(5040008, 100, 1, "楓點商店-實用雜物專區[瞬移之石]"),
    Array(2650004, 6000, 1, "楓點商店-實用雜物專區[捲軸包]"),
    Array(4330019, 6000, 1, "楓點商店-實用雜物專區[硬幣包]"),
    Array(5520000, 6000, 1, "楓點商店-實用雜物專區[神奇剪刀]"),
    Array(5520001, 3000, 1, "楓點商店-實用雜物專區[白金神奇剪刀]"),
    Array(5520003, 2000, 1, "楓點商店-實用雜物專區[寵物神奇剪刀]"),
    Array(5520002, 1000, 1, "楓點商店-實用雜物專區[時裝神奇剪刀]"),
    Array(5133000, 1000, 1, "楓點商店-實用雜物專區[凍結加持器]"),
    Array(5130000, 1000, 1, "楓點商店-實用雜物專區[護身符]"),
    Array(5192000, 8000, 1, "楓點商店-實用雜物專區[寵物強化箱]"),
    Array(2432318, 2000, 1, "楓點商店-實用雜物專區[寵物技能組]"),
    Array(5190010, 5000, 1, "楓點商店-實用雜物專區[寵物加持技能]"),
    Array(5170000, 1000, 1, "楓點商店-實用雜物專區[取寵物名]"),
    Array(5700000, 1000, 1, "楓點商店-實用雜物專區[機器人取名券]"),
    //Array(5689000, 10000, 1, "楓點商店-實用雜物專區[優質生命水]"),
    Array(5370000, 1000, 1, "楓點商店-實用雜物專區[黑板 1天]沒辦法限時"),
    //Array(2048716, 5000, 1, "楓點商店-實用雜物專區[強力的輪迴星火]"),    
    Array(5155005, 1000, 1, "楓點商店-實用雜物專區[卡勒塔的珍珠]"),
    Array(5800000, 2500, 1, "楓點商店-實用雜物專區[甜心魔粉餅]"),
    Array(5800001, 2500, 1, "楓點商店-實用雜物專區[花樣魔粉餅]"),
    Array(5800002, 2500, 1, "楓點商店-實用雜物專區[魅力魔粉餅]"),
    Array(2350004, 4000, 1, "楓點商店-實用雜物專區[凱薩型態變色]"),
    Array(2432946, 3000, 1, "楓點商店-實用雜物專區[自定義混色染髮券]"),
    Array(5152300, 3000, 1, "楓點商店-實用雜物專區[自定義混色瞳孔變色券]"),
    Array(5860000, 5000, 1, "楓點商店-實用雜物專區[染色顏料]"),
    Array(5860001, 5000, 1, "楓點商店-實用雜物專區[還原顏料]"),
    Array(5860002, 50000, 1, "楓點商店-實用雜物專區[自定義顏料]"),
    Array(5062400, 3000, 1, "楓點商店-實用雜物專區[神秘鐵砧]"),
    Array(5062402, 10000, 1, "楓點商店-實用雜物專區[勳章的神秘鐵鉆]"),
    Array(5062404, 10000, 1, "楓點商店-實用雜物專區[時裝神秘鐵砧]"),
    Array(5155002, 5000, 1, "楓點商店-實用雜物專區[透明傑諾印記]"),
    Array(5155003, 5000, 1, "楓點商店-實用雜物專區[透明魔族的標識]"),
    Array(5155006, 5000, 1, "楓點商店-實用雜物專區[深淵的洗禮]"),
    Array(2892000, 5000, 1, "楓點商店-實用雜物專區[透明機器人耳飾感應器]"),
    // Array(5155001, 5000, 1, "楓點商店-實用雜物專區[透明凱薩尾巴]"),
    Array(5012001, 5000, 1, "楓點商店-實用雜物專區[透明幻獸師尾]"),
    Array(5012000, 5000, 1, "楓點商店-實用雜物專區[透明幻獸師耳朵]"),
    Array(5680531, 5000, 1, "楓點商店-實用雜物專區[髮型欄位擴充券]"),
    Array(5680733, 5000, 1, "楓點商店-實用雜物專區[整形欄位擴充券]"),
    Array(5680889, 5000, 1, "楓點商店-實用雜物專區[皮膚欄位擴充券]"),
    Array(5156000, 5000, 1, "楓點商店-實用雜物專區[偉大的變身之藥]"),
    Array(5152111, 5000, 1, "日拋眼睛"),
    Array(5110000, 10000, 1, "紅星巧克力"),

);
txt = "Welcome to the special trip              " + a38 + "\r\n";

txt += "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "\r\n"
txt += "#fs12##b";
for (var i = 1; i < items.length; i++) {
    txt += "#L" + i + "##b#e#v" + items[i][0] + "# #k#z" + items[i][0] + "##b #r" + items[i][1] + " #b楓點#n\r\n";
}
let selection = npc.askMenu(txt, 9062453);
i = selection;
if (items[i][0] == 5110000) {
    selection = npc.askNumber("購買道具為：#v" + items[i][0] + "# #z" + items[i][0] + "##k\r\n請輸入購買個數：", 1, 1, 1);
} else {
    selection = npc.askNumber("購買道具為：#v" + items[i][0] + "# #z" + items[i][0] + "##k\r\n請輸入購買個數：", 1, 1, 999);
}


if (i) {
    GS = selection;
    QSS = GS * items[i][1];
    if (player.getCashShopCurrency(2) < QSS) {
        npc.say("#fs16##b#e楓葉點數不足，無法購買");
    } else if (player.getFreeSlots(2) >= 1 || player.getFreeSlots(5) >= 1) {
        player.showSystemMessage("消耗 [ " + (QSS) + " ] 楓點");
        player.modifyCashShopCurrency(2, -QSS);
        if (items[i][0] == 5370000) {
            gainItemPeriod(items[i][0], items[i][2] * GS)
        } else {
            player.gainItem(items[i][0], items[i][2] * GS);
        }
        npc.say("#fs16##b#e購買成功");
        player.runScript("其他雜物");
    } else {
        npc.say("#fs16##b#e欄位保留1格以上再購買");
    }
}

function gainItemPeriod(itemid, quantity, time) {
    //if(time < 1000 && time > 0){
    time = 1000 * 60 * 60 * 24 * 7;				//定義時間1000*秒*分鐘*時
    //}
    for (var i = 0; i < quantity; i++) {
        let newItem = player.makeItemWithId(itemid);
        if (time != 0) {
            newItem.setExpiration(new Date().getTime() + time);
        }
        player.gainItem(newItem);
        //npc.sayS("獲得時限道具");
    }
}