// jili
var a1 = "#fUI/UIWindowString/Scenario/quest_info/scene/summary_icon/summary#"
var equip = [Array(1213021, 1213018, 1213022, "特米納斯調諧器", "神祕之影調諧器", "創世調諧器"),
Array(1292021, 1292018, 1292022, "特米納斯扇子", "神祕之影草扇", "創世扇"),
Array(1592021, 1592020, 1592022, "特米納斯古弓", "神祕之影遠古弓", "創世遠古弓"),
Array(1282039, 1282017, 1282040, "特米納斯終點魔力手套", "神祕之影魔力手套", "創世魔力手套"),
Array(1272039, 1272017, 1272040, "特米納斯極限鎖鏈", "神祕之影鎖鏈", "創世鎖鏈"),
Array(1582043, 1582023, 1582044, "特米納斯爆裂鐵拳", "神祕之影機甲槍", "創世機甲槍"),
Array(1552129, 1552119, 1552130, "特米納斯召喚摺扇", "神祕之影摺扇", "創世扇子"),
Array(1542127, 1542117, 1542128, "特米納斯一文字刀", "神祕之影武士刀", "創世武士刀"),
Array(1252105, 1252098, 1252106, "特米納斯動物魔法棒", "神祕之影魔法槌", "創世權杖"),
Array(1532156, 1532150, 1532157, "特米納斯爆燃手炮", "神祕之影攻城炮", "創世攻城炮"),
Array(1522151, 1522143, 1522152, "特米納斯猛獸雙弩槍", "神祕之影雙弩槍", "創世雙弩槍"),
Array(1492244, 1492235, 1492245, "特米納斯暴徒短槍", "神祕之影短槍", "創世手銃"),
Array(1482231, 1482221, 1482232, "特米納斯突擊指節", "神祕之影指節", "創世拳爪"),
Array(1472274, 1472265, 1472275, "特米納斯天罰拳套", "神祕之影拳套", "創世鬥拳"),
Array(1462251, 1462243, 1462252, "特米納斯疾風弩", "神祕之影弩", "創世弩"),
Array(1442284, 1442274, 1442285, "特米納斯戰爭矛", "神祕之影矛", "創世長戟"),
Array(1432226, 1432218, 1432227, "特米納斯尖刺槍", "神祕之影長槍", "創世槍"),
Array(1452265, 1452257, 1452266, "特米納斯風暴弓", "神祕之影弓", "創世弓箭"),
Array(1422196, 1422189, 1422197, "特米納斯爆破鈍器", "神祕之影雙手錘", "創世雙手錘"),
Array(1412188, 1412181, 1412189, "特米納斯破壞大斧", "神祕之影雙手戰斧", "創世雙手戰斧"),
Array(1402267, 1402259, 1402268, "特米納斯壓制巨劍", "神祕之影雙手劍", "創世雙手劍"),
Array(1382273, 1382265, 1382274, "特米納斯催眠長杖", "神祕之影長杖", "創世長杖"),
Array(1403021, 1403018, 1403022, "特米納斯催眠長杖", "神祕之影長杖", "創世長杖"),
Array(1372236, 1372228, 1372237, "特米納斯附魔短杖", "神祕之影短杖", "創世短杖"),
Array(1362148, 1362140, 1362149, "特米納斯管絃樂手杖", "神祕之影手杖", "創世手杖"),
Array(1332288, 1332279, 1332289, "特米納斯徘徊刀", "神祕之影刃", "創世短刀"),
Array(1322263, 1322255, 1322264, "特米納斯粉碎錘", "神祕之影錘", "創世錘"),
Array(1312212, 1312203, 1312213, "特米納斯撕裂斧", "神祕之影斧", "創世斧"),
Array(1302354, 1302343, 1302355, "特米納斯分裂劍", "神祕之影單手劍", "創世軍刀"),
Array(1262050, 1262039, 1262051, "特米納斯ESP限制器", "神祕之影ESP限制器", "創世ESP限制器"),
Array(1242140, 1242122, 1242141, "特米納斯狙擊能量劍", "神祕之影能量劍", "創世聚能鎖鏈劍"),
Array(1232121, 1232113, 1232122, "特米納斯亡命征服者", "神祕之影亡命劍", "創世亡命劍"),
Array(1222121, 1222113, 1222122, "特米納斯烈焰魂手銃", "神祕之影靈魂手銃", "創世靈魂手銃"),
Array(1212128, 1212120, 1212129, "特米納斯啟迪雙頭杖", "神祕之影雙頭杖", "創世雙頭杖")];



var str = "				#fs16##r解封創世武器#fs13\r\n\r\n";

str += "#b恭喜你冒險家終於走到了這一步~\r\n"
str += "1.請將你的#r<未解封>#b的創世武器放到裝備欄#r第一格#b\r\n"
str += "2.請將您乾淨的#r<神秘>#b的同職業武器放到裝備欄#r第二格#b\r\n";
str += "3.#b需要材料如下:\r\n";
str += "4.#v4310107##z4310107#*5  #v4310218##z4310218#*30\r\n";
str += "5.#v4000729##z4000729#*4000 #v4000743##z4000743#*4000\r\n";
str += "6.#v4000730##z4000730#*4000 #v4000740##z4000740#*4000\r\n";
str += "7.#v4032053##z4032053#*30000 #v4001715##z4001715#*10\r\n";
str += "8.確認解封請點擊[#r是#b]\r\n";

if (npc.askYesNo(str) == 1) {
    let toDrop = player.getInventorySlot(1, 1);
    if (toDrop == null) {
        npc.say("第一格沒有東西！")
    } else if (!player.hasItem(4310107, 5)) {
        npc.say("#v4310107##z4310107#不足。");
    } else if (!player.hasItem(4310218, 30)) {
        npc.say("#v4310218##z4310218#不足。");
    } else if (!player.hasItem(4000729, 4000)) {
        npc.say("#v4000729##z4000729#不足。");
    } else if (!player.hasItem(4000743, 4000)) {
        npc.say("#v4000743##z4000743#不足。");
    } else if (!player.hasItem(4000740, 4000)) {
        npc.say("#v4000740##z4000740#不足。");
    } else if (!player.hasItem(4000730, 4000)) {
        npc.say("#v4000730##z4000730#不足。");
    } else if (!player.hasItem(4032053, 30000)) {
        npc.say("#v4032053##z4032053#不足。");
    } else if (!player.hasItem(4001715, 10)) {
        npc.say("#v4001715##z4001715#不足。");
    } else {
        var index = -1;
        for (var i = 0; i < equip.length; i++) {
            if (equip[i][0] == toDrop.getDataId()) {
                index = i;
                break;
            }
        }
        if (index == -1) {
            npc.say("第一格不是需要的未解封的創世裝備")

        } else {
            let slot = "";
            for (var i = 2; i <= 2; i++) {
                var toDrop1 = player.getInventorySlot(1, i);
                if (toDrop1 == null || toDrop1.getDataId() != equip[index][1]) {
                    slot += i + " "
                }
            }
            if (slot != "") {
                npc.say("第" + slot + "格，需要的是#v" + equip[index][1] + "#，您當前不滿足要求")
            } else {
                str = "是否確認使用#v" + equip[index][0] + "#以及1件#v" + equip[index][1] + "#解封為#v" + equip[index][2] + "#?"
                if (npc.askYesNo(str) == 1) {

                    for (var i = 1; i <= 2; i++) {
                        player.loseInvSlot(1, i);
                    }

                    let newItem = player.makeItemWithId(equip[index][2]);
                    //newItem.setAttribute(newItem.getAttribute() + 1);

                    player.gainItem(newItem);
                    player.loseItem(4310107, 5);
                    player.loseItem(4310218, 30);
                    player.loseItem(4000729, 4000);
                    player.loseItem(4000743, 4000);
                    player.loseItem(4000740, 4000);
                    player.loseItem(4000730, 4000);
                    player.loseItem(4032053, 30000);
                    player.loseItem(4001715, 10);
                    //map.blowWeather(5120003,""+player.getName()+"透過獻祭5把【"+ equip[index][4]+"】將強化15品的【"+ equip[index][3]+"】進階為【"+ equip[index][5]+"】");//喇叭特效
                    //npc.broadcastPlayerNotice(15, "== 創世錄 ==:" + player.getName() + "透過獻祭5把【" + equip[index][4] + "】和強化15品的【" + equip[index][3] + "】成功製作出【" + equip[index][5] + "】");
                    npc.broadcastPlayerNotice(13, "[創世解封]  玩家家: " + player.getName() + "  成功破除【" + toDrop.getItemName() + "】,的封印之力");
                    //npc.broadcastWeatherEffectNotice(232, "== 創世錄 ==  " + player.getName() + "透過獻祭5把【" + equip[index][4] + "】和強化15品的【" + equip[index][3] + "】成功製作出【" + equip[index][5] + "】", 5120006);
                    //npc.broadcastWeatherEffectNotice(2,"五醬超漂亮",10000);
                    npc.say("成功解封")
                }
            }
        }

    }
} else {
    npc.say("真遺憾，下次再見")
}



