/**
 *
 * @description Answer questions
 */
let Qicon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
let icon = "#fUI/UIWindow/PartySearch2/BtNext/mouseOver/0#";
let tzIcon = "#fUI/Basic/BtCoin/mouseOver/1#";

let itemtk1 = Array(
    Array("—二三四五六七八九", "缺衣少食", "缺斤短兩", "缺一不可", "一卻十求", "1"),
    Array("門裡站著一個人", "燜", "悶", "門", "閃", "4"),
    Array("會飛不是鳥，像鼠不是鼠。白天躲暗處，夜晚捉害蟲", "烏鴉", "蝙蝠", "貓頭鷹", "麻雀", "2"),
    Array("一個男人加一個女人會成了什麼", "人", "兩個人", "三個人", "朲", "2"),
    Array("《名偵探柯南》中，灰原哀的本名叫做", "笠美奈穗", "笠美奈美", "宮野志保", "瀧澤蘿拉", "3"),
    Array("什麼書買不到", "遺書", "小黃書", "漫畫書", "教科書", "1"),
    Array("聲音在()裡傳播更快", "液體", "氣體", "真空", "固體", "4"),
    Array("戛納電影在()舉辦", "丹麥", "法國", "英國", "義大利", "2"),
    Array("蘇伊士運河屬於哪個國家", "英國", "西班牙", "埃及", "巴西", "3"),
    Array("太陽系中最大的行星是", "火星", "冥王星", "木星", "土星", "3"),
    Array("英雄聯盟S3賽季總冠軍是", "SKT", "TPA", "Fnatic", "SSW", "1"),
    Array("第一個飛出太陽系的航天器是", "先驅者9號", "先驅者10號", "先驅者11號", "先驅者12號", "2"),
    Array("聖誕頌歌《平安夜》的誕生地是", "紐約", "倫敦", "丹麥", "奧地利", "4"),
    Array("冰球比賽中每隊上場人數是", "5", "6", "10", "11", "2"),
    Array("第一屆世界盃足球賽是在哪個國家舉行", "德國", "巴西", "衣索比亞", "烏拉圭", "4"),
    Array("第一屆奧運會什麼時候開始舉行", "1896", "1905", "1890", "1912", "1"),
    Array("圍棋共有多少個棋子?", "180", "181", "360", "361", "4"),
    Array("下列那一種顏色，忍者龜的眼罩沒有", "紫", "黃", "白", "藍", "3"),
    Array("面積最小的國家是", "西班牙", "朝鮮", "韓國", "梵蒂岡", "4"),
    Array("「相對論」是由誰提出的", "牛頓", "愛因斯坦", "福布斯", "庫克", "2"),
    Array("太陽早上是由哪邊升起？", "東方", "西方", "北方", "南方", "1"),
    Array("奧運是每幾年舉辦一次？", "兩年", "四年", "六年", "八年", "2"),
    Array("周杰倫成名曲：「手牽手一步兩步三步四步望著天」歌曲名稱是？", "晴天", "夜曲", "說好的幸福呢", "星晴", "4"),
    Array("月球繞著地球運轉", "順轉", "逆轉", "公轉", "亂轉", "3"),
    Array("時鐘六點的時候，分針和時針的角度是？", "110度", "180度", "160度", "360度", "2"),
    Array("稱呼自己媽媽的媽媽叫做", "媽媽", "奶奶", "婆婆", "外婆", "4"),
    Array("彩虹除了紅橙綠藍靛紫以外還有那一種顏色?", "黃色", "紫色", "紅色", "白色", "1"),
    Array("下列人物中哪一個是曹操的兒子", "曹丕", "曹腾", "曹爽", "曹纯", "1"),
    Array("最狹長的國家?", "中國", "美國", "俄羅斯", "智利", "4"),
    Array("蝸牛是哪一類動物", "爬行動物", "兩棲動物", "軟體動物", "肉食動物", "3"),
    Array("荷蘭的國花是?", "鬱金香", "牡丹花", "杜鵑花", "月季花", "1"),
    Array("1點的時候時鐘是呈幾度?", "20度", "30度", "40度", "50度", "2"),
    Array("蜘蛛人的基本配色是什麼?", "紅和藍", "白和藍", "紅和黑", "黑和藍", "1"),
    Array("指針型時鐘呈直角時是幾點?", "1點", "2點", "3點", "4點", "3"),
    Array("給小狗吃啥會不舒服?", "大便", "辣椒", "麵包", "巧克力", "4"),
    Array("12生肖中，沒有哪一種動物?", "獅子", "老虎", "猴子", "蛇", "1"),
    Array("夜盲症是因為缺少了什麼?", "維他命Ａ", "維他命B", "維他命C", "維他命D", "1"),
    Array("藝人「周杰倫」的英文名字是?", "jie", "may", "Jay", "miss", "3"),
    Array("兩極在哪個季節會出現永晝或永夜", "春天", "夏天", "秋天", "冬天", "4"),
    Array("1001-899等於？", "101", "102", "111", "112", "2"),
    Array("電影中黃飛鴻是與哪位女性互有好感？", "十三姨", "滿姨", "十八姨", "大姨媽", "1"),
    Array("得道者多助，失道者寡助。出自", "《禮記》", "《老子》", "《孟子》", "《孫子》", "3"),
    Array("溫故而知新，可以為師矣。出自 ", "《論語》", "《莊子》", "《禮記》", "《孟子》", "1"),
    Array("筆墨紙硯是文房四寶。四寶又以（）為首。", "筆", "墨", "紙", "硯", "4"),

    Array("下列字義，何者前後相同？", "旁「徵」博引 ／ 「徵」人啟事", "逐年「遞」減 ／ 傳「遞」訊息", "待人接「物」 ／ 言之有「物」", "「好」一一聽之 ／ 「好」勇鬥狠", "4"),
    Array("「濫竽充數」這個故事，其實要強調為政者的作為應該要如何？", "考核確實，剔除庸才", "恩威並重，賞罰分明", "廣披恩澤，厚加爵祿", "大公無私，唯才是用", "1"),
    Array("試問下列「」內成語何者使用正確？", "法官斷案應秉著「毋枉毋縱」的原則，按證據決斷", "他見人慣是「前倨後恭」，頗受大家喜愛", "讀書若是「不求甚解」，便把活潑的讀書心性束縛了", "他做事總「我行我素」，有自己獨到見解", "1"),
    Array("試問下列何選項與胡適說的「做學問要在不疑處有疑」語意雷同？", "盡信書，則不如無書", "人不學習，再聰明也目不識丁", "要怎麼收穫，先那麼栽", " 知之為知之，不知為不知，是知也", "1"),
    Array("下列「」內用字何者完全正確？", "稱職「祕」書 / 隱「密」之事", "四肢痙「孿」 / 「攣」生兄弟", "慈「詳」長輩 / 「祥」細解說", "滋生「幣」端 / 劣「弊」驅逐良「弊」", "1"),

    Array("「飄流的雲沒有家，天一陰就急得不住地流眼淚」句中「沒有家」與「流眼淚」將雲「人性化」，下列選項何者也使用此種寫法？", "深情一眼摯愛千年，幾度輪迴戀戀不滅", "成群的螢火蟲好似晶瑩的小星星，閃爍著點點亮光", "剩下牛女二星，在情淚堆積的天河，划起輕妙的小艇", "聽完老祖母故事，小弟弟和小妹妹闔上眼走入夢鄉", "3"),
    Array("關於<夏夜>的解讀何者正確？", "作者透過兒童的口吻描繪出夏夜的美麗與涼爽", "「撒了滿天珍珠與一枚銀幣」營造夏夜的盎然生機", "寫小河及夜風還醒著是為表達夜晚喧鬧嘈雜", "由弟弟妹妹的夢境表達他們的慌張忙亂與不知所措", "1"),
    Array("完整的譬喻修辭有喻體+喻詞+喻依+補充說明四部分，而借喻其餘部分皆省略，只有喻依。如「撒了滿天的珍珠與一枚又大又亮的銀幣」裡的「珍珠」指星星，「銀幣」指「月亮」。試問下列何者屬於「借喻」修辭？", "時間，愛情的煉金石", "路遙知馬力，日久見人心", "一朵鮮花插在牛糞上", "河畔的金柳是夕陽中的新娘", "3"),
    Array("下列新詩何者歌詠的主題是瀑布？", "佔領風景必備之 / 白皮書", "令靜止的事物 / 群情 / 騷動", "山 / 垂一條領帶 / 抖著男子漢瀟灑的氣派", "憨直的傻小子 / 幾度落髮 / 幾度還俗", "3"),
    Array("下列「」內成語運用何者錯誤？", "名嘴對外星人入侵說得若有其事，這種「不白之冤」就別理會了", "當紅歌手常受「盛名之累」，一舉一動備受矚目，私生活飽受干擾", " 對於我犯的錯，他雖然沒有直接痛罵，但話中的「言外之意」仍讓我難受不已", "網路賣家明知這件廣告商品與實物落差很大，為了拉抬買氣，仍不惜說出「違心之論」，實在沒良心", "1"),

    Array("論據為用以支持論點的證據、理由、材料等，是論說文必備的部分。試問在<無心的錯誤>一文中，下列何者不是作者提出的論證？", "肯尼酒醉駕車肇事", "兒子助陌生人開鎖", "作者學生非法討債", "留學生飛機上開玩笑要劫機", "1"),
    Array("下列成語何者與「濫竽充數」意思接近？", "陳腔濫調", "魚目混珠", "名符其實", "畫餅充飢", "2"),
    Array("關於<無心的錯誤>寫作手法的說明，下列何者正確？", "作者以先議後敘的方式探討「無心之過」", "舉例豐富多元，涵蓋古今中外的事例", "作者用親身做過的事例說明沒有惡意也會產生惡果", "文末以「無心往往就是一種錯誤」總結，強調主旨", "4"),
    Array("「我們都知道年輕人常犯無心之過，只是那錯誤又可能造成難以彌補的傷害」這段文字要表達何種意思？", "退一步海闊天空", "經一事長一智", "一失足成千古恨", "有志者事竟成", "3"),

    Array("「棄其杖，化為鄧林」的「鄧林」詞性與下列何者相同？", "夸父與日「逐走」", "欲得飲，「飲」於河渭", "河渭不「足」，北飲大澤", "未至，「道」渴而死", "4"),
    Array("下列何者是<無心的錯誤>要告訴我們的啟示？", "勸勉大家知過能改，善莫大焉", "警示大家要三思後行，對事要審慎面對", "寬慰大家善惡到頭終有報，不必太自責", "提醒大家，別片面下結論，要體會別人的難處", "2"),
    Array("下列各組「 」中的字，何者讀音相同？", "隱「晦」之事 ／ 諄諄教「誨」", "拱手作「揖」 ／ 通「緝」要犯", "氣息「奄」奄 ／ 「掩」耳盜鈴", "一盤「散」沙 ／ 曲終人「散」", "1"),
    Array("下列敘述，何者為前句原因後句結果的因果句？", "夸父與日逐走，入日", "(夸父)未至，道渴而死", "齊宣王使人吹竽，必三百人", "好一一聽之，處士逃", "4"),
    Array("關於<母親的教誨>的作法，下列敘述何者錯誤？", "藉實例的敘述，凸顯母親慈母兼任嚴父的形象", "用對話與方言，使人物更為生動與具體", "採第三人稱口吻，回憶母親寬嚴並濟的教育方式", "結尾抒感，將自己的好品行歸功於母親的教導", "3"),
    Array("利用語言文字音同或音近關係，使一句話或一個詞關涉到兩件事，產生互為聯想的關係為諧音雙關。試問下列「」內詞何者沒有使用諧音雙關？", "「有口皆杯」的飲料店招牌真吸引人", "他真是貧窮阿，連鞋子也「腳踏實地」", "媽媽的規勸，大華總不耐煩地「一言九頂」", "大雪癱瘓交通，乘客在車裡「凍彈不得」", "2"),
    Array("試問下列成語何者解讀錯誤？", " 蓬蓽生輝：形容貴客來訪", "汗牛充棟：形容書籍極多", "師表千古：哀輓師長去世", "鍾靈毓秀：形容女子秀美溫婉", "4"),
    Array("下列對話的語氣，何者解讀正確？", "穿上吧，涼了：責備", "你要學他，不要跌他的股：叮嚀", "娘(涼)什麼，老子都不老子了：假設", "你沒有老子，是多麼得意的事，好用來說嘴：讚嘆", "2"),
    Array("文章裡用來標明語意轉變、聲音延續、時空起止或補充說明的符號，稱為破折號。試問下列各句的破折號，何者使用錯誤？", "這是他平生收到的第一個禮物──毛線毛衣", "噹──噹──噹──，鐘聲響了，學生魚貫地進入考場。", "這個企劃案愈修改問題愈多──也罷，反正我們不可能盡善盡美", "遠望孤船漸行漸遠，終隱沒在青山間，這時，只見江水滔滔不絕向天邊去──。", "4"),
    Array("有塊招牌寫文字如下「過往人等不得於此丟垃圾」，試問下列何標點表達意思為「禁止丟垃圾」？", "過往人，等不得，於此丟垃圾。", "過往人，等不得，於此丟垃圾", "過往人等，不得於此丟垃圾？", "過往人等，不得於此丟垃圾", "4"),
    Array("7x8等於？", "56", "76", "86", "66", "1"),
    Array("5x6等於？", "10", "20", "30", "40", "3"),
    Array("1x1等於？", "111", "11", "1", "2", "3"),
    Array("1452+258等於？", "1232", "1642", "1711", "1710", "4"),
    Array("99-88等於？", "10", "11", "9", "12", "2"),
    Array("100x100等於？", "1000", "10000", "100", "100000", "2"),
    Array("3x6等於？", "16", "17", "18", "15", "3"),
    Array("1-1等於？", "0", "1", "2", "3", "1"),
    Array("56-1等於？", "56", "54", "55", "57", "3"),
    Array("368-27等於？", "340", "339", "341", "342", "3"),
    Array("100-99等於？", "1", "2", "-1", "0", "1"),
    Array("8754-899等於？", "8855", "7854", "7855", "7852", "3"),
    Array("9x9等於？", "81", "82", "80", "83", "1"),


);

let itemtk2 = Array(
    Array("得道者多助，失道者寡助。出自", "《禮記》", "《老子》", "《孟子》", "《孫子》", "3"),
    Array("溫故而知新，可以為師矣。出自 ", "《論語》", "《莊子》", "《禮記》", "《孟子》", "1"),
    Array("筆墨紙硯是文房四寶。四寶又以（）為首。", "筆", "墨", "紙", "硯", "4"),

    Array("下列字義，何者前後相同？", "旁「徵」博引 ／ 「徵」人啟事", "逐年「遞」減 ／ 傳「遞」訊息", "待人接「物」 ／ 言之有「物」", "「好」一一聽之 ／ 「好」勇鬥狠", "4"),
    Array("「濫竽充數」這個故事，其實要強調為政者的作為應該要如何？", "考核確實，剔除庸才", "恩威並重，賞罰分明", "廣披恩澤，厚加爵祿", "大公無私，唯才是用", "1"),
    Array("試問下列「」內成語何者使用正確？", "法官斷案應秉著「毋枉毋縱」的原則，按證據決斷", "他見人慣是「前倨後恭」，頗受大家喜愛", "讀書若是「不求甚解」，便把活潑的讀書心性束縛了", "他做事總「我行我素」，有自己獨到見解", "1"),
    Array("試問下列何選項與胡適說的「做學問要在不疑處有疑」語意雷同？", "盡信書，則不如無書", "人不學習，再聰明也目不識丁", "要怎麼收穫，先那麼栽", " 知之為知之，不知為不知，是知也", "1"),
    Array("下列「」內用字何者完全正確？", "稱職「祕」書 / 隱「密」之事", "四肢痙「孿」 / 「攣」生兄弟", "慈「詳」長輩 / 「祥」細解說", "滋生「幣」端 / 劣「弊」驅逐良「弊」", "1"),

    Array("「飄流的雲沒有家，天一陰就急得不住地流眼淚」句中「沒有家」與「流眼淚」將雲「人性化」，下列選項何者也使用此種寫法？", "深情一眼摯愛千年，幾度輪迴戀戀不滅", "成群的螢火蟲好似晶瑩的小星星，閃爍著點點亮光", "剩下牛女二星，在情淚堆積的天河，划起輕妙的小艇", "聽完老祖母故事，小弟弟和小妹妹闔上眼走入夢鄉", "3"),
    Array("關於<夏夜>的解讀何者正確？", "作者透過兒童的口吻描繪出夏夜的美麗與涼爽", "「撒了滿天珍珠與一枚銀幣」營造夏夜的盎然生機", "寫小河及夜風還醒著是為表達夜晚喧鬧嘈雜", "由弟弟妹妹的夢境表達他們的慌張忙亂與不知所措", "1"),
    Array("完整的譬喻修辭有喻體+喻詞+喻依+補充說明四部分，而借喻其餘部分皆省略，只有喻依。如「撒了滿天的珍珠與一枚又大又亮的銀幣」裡的「珍珠」指星星，「銀幣」指「月亮」。試問下列何者屬於「借喻」修辭？", "時間，愛情的煉金石", "路遙知馬力，日久見人心", "一朵鮮花插在牛糞上", "河畔的金柳是夕陽中的新娘", "3"),
    Array("下列新詩何者歌詠的主題是瀑布？", "佔領風景必備之 / 白皮書", "令靜止的事物 / 群情 / 騷動", "山 / 垂一條領帶 / 抖著男子漢瀟灑的氣派", "憨直的傻小子 / 幾度落髮 / 幾度還俗", "3"),
    Array("下列「」內成語運用何者錯誤？", "名嘴對外星人入侵說得若有其事，這種「不白之冤」就別理會了", "當紅歌手常受「盛名之累」，一舉一動備受矚目，私生活飽受干擾", " 對於我犯的錯，他雖然沒有直接痛罵，但話中的「言外之意」仍讓我難受不已", "網路賣家明知這件廣告商品與實物落差很大，為了拉抬買氣，仍不惜說出「違心之論」，實在沒良心", "1"),

    Array("論據為用以支持論點的證據、理由、材料等，是論說文必備的部分。試問在<無心的錯誤>一文中，下列何者不是作者提出的論證？", "肯尼酒醉駕車肇事", "兒子助陌生人開鎖", "作者學生非法討債", "留學生飛機上開玩笑要劫機", "1"),
    Array("下列成語何者與「濫竽充數」意思接近？", "陳腔濫調", "魚目混珠", "名符其實", "畫餅充飢", "2"),
    Array("關於<無心的錯誤>寫作手法的說明，下列何者正確？", "作者以先議後敘的方式探討「無心之過」", "舉例豐富多元，涵蓋古今中外的事例", "作者用親身做過的事例說明沒有惡意也會產生惡果", "文末以「無心往往就是一種錯誤」總結，強調主旨", "4"),
    Array("「我們都知道年輕人常犯無心之過，只是那錯誤又可能造成難以彌補的傷害」這段文字要表達何種意思？", "退一步海闊天空", "經一事長一智", "一失足成千古恨", "有志者事竟成", "3"),

    Array("「棄其杖，化為鄧林」的「鄧林」詞性與下列何者相同？", "夸父與日「逐走」", "欲得飲，「飲」於河渭", "河渭不「足」，北飲大澤", "未至，「道」渴而死", "4"),
    Array("下列何者是<無心的錯誤>要告訴我們的啟示？", "勸勉大家知過能改，善莫大焉", "警示大家要三思後行，對事要審慎面對", "寬慰大家善惡到頭終有報，不必太自責", "提醒大家，別片面下結論，要體會別人的難處", "2"),
    Array("下列各組「 」中的字，何者讀音相同？", "隱「晦」之事 ／ 諄諄教「誨」", "拱手作「揖」 ／ 通「緝」要犯", "氣息「奄」奄 ／ 「掩」耳盜鈴", "一盤「散」沙 ／ 曲終人「散」", "1"),
    Array("下列敘述，何者為前句原因後句結果的因果句？", "夸父與日逐走，入日", "(夸父)未至，道渴而死", "齊宣王使人吹竽，必三百人", "好一一聽之，處士逃", "4"),
    Array("關於<母親的教誨>的作法，下列敘述何者錯誤？", "藉實例的敘述，凸顯母親慈母兼任嚴父的形象", "用對話與方言，使人物更為生動與具體", "採第三人稱口吻，回憶母親寬嚴並濟的教育方式", "結尾抒感，將自己的好品行歸功於母親的教導", "3"),
    Array("利用語言文字音同或音近關係，使一句話或一個詞關涉到兩件事，產生互為聯想的關係為諧音雙關。試問下列「」內詞何者沒有使用諧音雙關？", "「有口皆杯」的飲料店招牌真吸引人", "他真是貧窮阿，連鞋子也「腳踏實地」", "媽媽的規勸，大華總不耐煩地「一言九頂」", "大雪癱瘓交通，乘客在車裡「凍彈不得」", "2"),
    Array("試問下列成語何者解讀錯誤？", " 蓬蓽生輝：形容貴客來訪", "汗牛充棟：形容書籍極多", "師表千古：哀輓師長去世", "鍾靈毓秀：形容女子秀美溫婉", "4"),
    Array("下列對話的語氣，何者解讀正確？", "穿上吧，涼了：責備", "你要學他，不要跌他的股：叮嚀", "娘(涼)什麼，老子都不老子了：假設", "你沒有老子，是多麼得意的事，好用來說嘴：讚嘆", "2"),
    Array("文章裡用來標明語意轉變、聲音延續、時空起止或補充說明的符號，稱為破折號。試問下列各句的破折號，何者使用錯誤？", "這是他平生收到的第一個禮物──毛線毛衣", "噹──噹──噹──，鐘聲響了，學生魚貫地進入考場。", "這個企劃案愈修改問題愈多──也罷，反正我們不可能盡善盡美", "遠望孤船漸行漸遠，終隱沒在青山間，這時，只見江水滔滔不絕向天邊去──。", "4"),
    Array("有塊招牌寫文字如下「過往人等不得於此丟垃圾」，試問下列何標點表達意思為「禁止丟垃圾」？", "過往人，等不得，於此丟垃圾。", "過往人，等不得，於此丟垃圾", "過往人等，不得於此丟垃圾？", "過往人等，不得於此丟垃圾", "4"),
    Array("—二三四五六七八九", "缺衣少食", "缺斤短兩", "缺一不可", "一卻十求", "1"),
    Array("門裡站著一個人", "燜", "悶", "門", "閃", "4"),
    Array("會飛不是鳥，像鼠不是鼠。白天躲暗處，夜晚捉害蟲", "烏鴉", "蝙蝠", "貓頭鷹", "麻雀", "2"),
    Array("一個男人加一個女人會成了什麼", "人", "兩個人", "三個人", "朲", "2"),
    Array("《名偵探柯南》中，灰原哀的本名叫做", "笠美奈穗", "笠美奈美", "宮野志保", "瀧澤蘿拉", "3"),
    Array("什麼書買不到", "遺書", "小黃書", "漫畫書", "教科書", "1"),
    Array("聲音在()裡傳播更快", "液體", "氣體", "真空", "固體", "4"),
    Array("戛納電影在()舉辦", "丹麥", "法國", "英國", "義大利", "2"),
    Array("蘇伊士運河屬於哪個國家", "英國", "西班牙", "埃及", "巴西", "3"),
    Array("太陽系中最大的行星是", "火星", "冥王星", "木星", "土星", "3"),
    Array("英雄聯盟S3賽季總冠軍是", "SKT", "TPA", "Fnatic", "SSW", "1"),
    Array("第一個飛出太陽系的航天器是", "先驅者9號", "先驅者10號", "先驅者11號", "先驅者12號", "2"),
    Array("聖誕頌歌《平安夜》的誕生地是", "紐約", "倫敦", "丹麥", "奧地利", "4"),
    Array("冰球比賽中每隊上場人數是", "5", "6", "10", "11", "2"),
    Array("第一屆世界盃足球賽是在哪個國家舉行", "德國", "巴西", "衣索比亞", "烏拉圭", "4"),
    Array("第一屆奧運會什麼時候開始舉行", "1896", "1905", "1890", "1912", "1"),
    Array("圍棋共有多少個棋子?", "180", "181", "360", "361", "4"),
    Array("下列那一種顏色，忍者龜的眼罩沒有", "紫", "黃", "白", "藍", "3"),
    Array("面積最小的國家是", "西班牙", "朝鮮", "韓國", "梵蒂岡", "4"),
    Array("「相對論」是由誰提出的", "牛頓", "愛因斯坦", "福布斯", "庫克", "2"),
    Array("太陽早上是由哪邊升起？", "東方", "西方", "北方", "南方", "1"),
    Array("奧運是每幾年舉辦一次？", "兩年", "四年", "六年", "八年", "2"),
    Array("周杰倫成名曲：「手牽手一步兩步三步四步望著天」歌曲名稱是？", "晴天", "夜曲", "說好的幸福呢", "星晴", "4"),
    Array("月球繞著地球運轉", "順轉", "逆轉", "公轉", "亂轉", "3"),
    Array("時鐘六點的時候，分針和時針的角度是？", "110度", "180度", "160度", "360度", "2"),
    Array("稱呼自己媽媽的媽媽叫做", "媽媽", "奶奶", "婆婆", "外婆", "4"),
    Array("彩虹除了紅橙綠藍靛紫以外還有那一種顏色?", "黃色", "紫色", "紅色", "白色", "1"),
    Array("下列人物中哪一個是曹操的兒子", "曹丕", "曹腾", "曹爽", "曹纯", "1"),
    Array("最狹長的國家?", "中國", "美國", "俄羅斯", "智利", "4"),
    Array("蝸牛是哪一類動物", "爬行動物", "兩棲動物", "軟體動物", "肉食動物", "3"),
    Array("荷蘭的國花是?", "鬱金香", "牡丹花", "杜鵑花", "月季花", "1"),
    Array("1點的時候時鐘是呈幾度?", "20度", "30度", "40度", "50度", "2"),
    Array("蜘蛛人的基本配色是什麼?", "紅和藍", "白和藍", "紅和黑", "黑和藍", "1"),
    Array("指針型時鐘呈直角時是幾點?", "1點", "2點", "3點", "4點", "3"),
    Array("給小狗吃啥會不舒服?", "大便", "辣椒", "麵包", "巧克力", "4"),
    Array("12生肖中，沒有哪一種動物?", "獅子", "老虎", "猴子", "蛇", "1"),
    Array("夜盲症是因為缺少了什麼?", "維他命Ａ", "維他命B", "維他命C", "維他命D", "1"),
    Array("藝人「周杰倫」的英文名字是?", "jie", "may", "Jay", "miss", "3"),
    Array("兩極在哪個季節會出現永晝或永夜", "春天", "夏天", "秋天", "冬天", "4"),
    Array("1001-899等於？", "101", "102", "111", "112", "2"),

    Array("7x8等於？", "56", "76", "86", "66", "1"),
    Array("5x6等於？", "10", "20", "30", "40", "3"),
    Array("1x1等於？", "111", "11", "1", "2", "3"),
    Array("1452+258等於？", "1232", "1642", "1711", "1710", "4"),
    Array("99-88等於？", "10", "11", "9", "12", "2"),
    Array("100x100等於？", "1000", "10000", "100", "100000", "2"),
    Array("3x6等於？", "16", "17", "18", "15", "3"),
    Array("1-1等於？", "0", "1", "2", "3", "1"),
    Array("56-1等於？", "56", "54", "55", "57", "3"),
    Array("368-27等於？", "340", "339", "341", "342", "3"),
    Array("100-99等於？", "1", "2", "-1", "0", "1"),
    Array("8754-899等於？", "8855", "7854", "7855", "7852", "3"),
    Array("9x9等於？", "81", "82", "80", "83", "1"),
    Array("電影中黃飛鴻是與哪位女性互有好感？", "十三姨", "滿姨", "十八姨", "大姨媽", "1"),
    Array("得道者多助，失道者寡助。出自", "《禮記》", "《老子》", "《孟子》", "《孫子》", "3"),
    Array("溫故而知新，可以為師矣。出自 ", "《論語》", "《莊子》", "《禮記》", "《孟子》", "1"),
    Array("筆墨紙硯是文房四寶。四寶又以（）為首。", "筆", "墨", "紙", "硯", "4")
);

let date = new Date;
let year = date.getFullYear();
let month = date.getMonth() + 1;
let hour = date.getHours();
let minute = date.getMinutes();
let second = date.getSeconds();

let startTime = 1;
let endTime = 59;
let timeout = 30; //限時時間設定
let typed = 0;
let tknow = 0;

let text = "";
text += "開啟時間:每小時#r【 " + startTime + " 分 - " + endTime + " 分】#n#k,請準備：#b\r\n";
text += "伺服器當前時間：#r" + hour + "時:" + minute + "分:" + second + "秒#n#k\r\n";
text += Qicon + " 今日答題總數: #r" + getEventValue("答題總數", false) + " #b道[#r每日限制100道#b]#n#k\r\n";
text += Qicon + " 今日正確題目: #r" + getEventValue("每日完成答題", false) + " #b道[#r每日錯誤10道結束#b]#n#k\r\n\r\n";

text += "#L2##b" + icon + " 開始答題（" + timeout + "秒限時，速度要快哦）#l\r\n";
text += "#L3##r" + icon + " 答對題目數兌換道具#l\r\n";
text += "#L1##b" + icon + " 點此檢視答題詳細規則（新手必看）#l\r\n\r\n\r\n";
text += "#b注意:每天0點#r清空答題資料#b，請及時兌換\r\n";
let Sel = npc.askMenu(text);
if (Sel == 1) {
    npc.say("每次答題都有#b" + timeout + "秒鐘時間限制#k，超時則失敗\r\n指定時間內回答錯誤也失敗！\r\n點選開始答題後開始記時，在給出的題目中，#r一般有4個選項#k，請輸入你認為正確的選項，點選確認即可完成答題.\r\n#r#e每次回答正確後，將會#d隨機給你楓點獎勵");
} else if (Sel == 2) {
    if (getEventValue("每日完成答題", false) > 99) {//總答題次數
        npc.askMenuA("今日答題已上限");
    }
    if (player.getEventValue("回答錯誤") > 9) {//錯誤次數
        npc.askMenuA("今日答題錯誤次數已上限");
    }
    if (minute >= startTime && minute <= endTime) {
        let randx = Math.floor(Math.random() * 10);//隨機數0-9
        if (randx <= 5) {
            let randy = Math.floor(Math.random() * itemtk1.length);//取題庫1
            tknow = itemtk1[randy];
            time1 = new Date().getTime();
        } else {
            let randy = Math.floor(Math.random() * itemtk2.length);//取題庫2
            tknow = itemtk2[randy];
            time1 = new Date().getTime();
        }
        let selAnswer = npc.askText(Qicon + "#b問題：" + tknow[0] + "\r\n#r============================================#n#k\r\n#d答案1:" + tknow[1] + "\r\n答案2:" + tknow[2] + "\r\n答案3:" + tknow[3] + "\r\n答案4:" + tknow[4] + "\r\n============================================#n#k\r\n#r請輸入你認為正確的答案,如果是答案1就填1，答案2就填2\r\n", "", 0, 999);
        setEventValue("答題總數", 1);//記錄
        time2 = new Date().getTime();
        fee = selAnswer;
        if (fee == tknow[5]) {//驗證答案是否正確
            //計算兩個時間差
            if ((time2 - time1) / 1000 < timeout) {
                let randx = Math.floor(Math.random() * 9) + 1;
                let randy = Math.floor(Math.random() * 200000) + 500;//冒險幣
                let randdj = Math.floor(Math.random() * 10000) + 40000;//點卷
                let randdy = Math.floor(Math.random() * 50) + 100;//抵用
                setEventValue("每日完成答題", 1)
                setEventValue("總計答題", 1)
                if (randx < 3) {//冒險幣
                    player.modifyCashShopCurrency(2, randdj);
                    npc.say("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randdj + "楓點.");


                }
                if (randx >= 3 && randx < 6) {//抵用
                    //player.modifyCashShopCurrency(2, 2000);
                    player.modifyCashShopCurrency(2, randdj);
                    npc.say("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randdj + "楓點.");

                }
                if (randx >= 6 && randx <= 10) {//點券
                    //player.modifyCashShopCurrency(2, 3000);
                    player.modifyCashShopCurrency(2, randdj);

                    npc.say("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randdj + "楓點.");

                }
            } else {
                player.addEventValue("回答錯誤", 1, 1);
                //npc.broadcastPlayerNotice(1, "[每日答題]  : " + player.getName() + " 參與了和[智腦]的答題比賽，雖然答對了，但超時了！")
                player.showSystemMessage("很遺憾，回答是正確的，但是超時了！\r\n");

            }
        } else {
            player.addEventValue("回答錯誤", 1, 1);
            //npc.broadcastPlayerNotice(1, "[每日答題]  : " + player.getName() + " 參與了和[智腦]的答題比賽，答題錯誤你太笨啦！！！")
            npc.say("很遺憾，回答錯誤！\r\n#b正確答案:" + tknow[5] + "");

        }
    } else {
        npc.say("當前伺服器時間:" + hour + "點" + minute + "分\r\n時間還沒到哦.整點的" + startTime + "-" + endTime + "分可以答題，例如:\r\n#b1點" + startTime + "分至1點" + endTime + "分\r\n#r#b2點" + startTime + "分至2點" + endTime + "分\r\n#r#b20點" + startTime + "分至20點" + endTime + "分\r\n#r....");
    }



} else if (Sel == 3) {
    text = "#fs16##fn黑體#您今天答對的題目總數為:#r" + getEventValue("每日完成答題", false) + "道#d#fs14#\r\n";
    text += "#L1#" + icon + " #r#e換取(#i5060086#x5 #i5121060#x2)(需答對30道)#l\r\n\r\n";
    text += "#L2#" + icon + " 換取(#i2450158#x2 #i2022530#x2)(需要答對題目50道)#l\r\n\r\n";
    text += "#L3#" + icon + " 換取(#i5060048#x50)(需要答對題目80道)#l\r\n";
    let selReward = npc.askMenu(text);
    if (selReward == 1) {
        if (getEventValue("答題30獎勵", false) == 0) {
            if (player.getFreeSlots(1) < 5 || player.getFreeSlots(2) < 5 || player.getFreeSlots(3) < 5 || player.getFreeSlots(4) < 5 || player.getFreeSlots(5) < 5) {
                npc.say("包裹空間不足，請確保包裹每個欄位有至少 " + 5 + " 格空間");
            } else if (getEventValue("每日完成答題", false) >= 30) {
                setEventValue("答題30獎勵", 1)
                player.gainItem(5060086, 5);//定居金1E
                player.gainItem(5121060, 2);//定居金1E
                npc.say("獎勵已發放，請注意查收！");
            } else {
                npc.say("抱歉，您今天還沒有答對30道題目，請繼續努力！");
            }

        } else {
            npc.say("您已經領取過該獎勵！");
        }
    } else if (selReward == 2) {
        if (getEventValue("答題50獎勵", false) == 0) {
            if (player.getFreeSlots(1) < 5 || player.getFreeSlots(2) < 5 || player.getFreeSlots(3) < 5 || player.getFreeSlots(4) < 5 || player.getFreeSlots(5) < 5) {
                npc.say("包裹空間不足，請確保包裹每個欄位有至少 " + 5 + " 格空間");
            } else if (getEventValue("每日完成答題", false) >= 50) {
                setEventValue("答題50獎勵", 1)
                setEventValue("每日完成答題", 1)
                player.gainItem(2450158, 2);//唯一魔方
                player.gainItem(2022530, 2);//唯一魔方
                npc.say("獎勵已發放，請注意查收！");
            } else {
                npc.say("抱歉，您今天還沒有答對50道題目，請繼續努力！");
            }

        } else {
            npc.say("您已經領取過該獎勵！");
        }
    } else if (selReward == 3) {
        if (getEventValue("答題80獎勵", false) == 0) {
            if (player.getFreeSlots(1) < 5 || player.getFreeSlots(2) < 5 || player.getFreeSlots(3) < 5 || player.getFreeSlots(4) < 5 || player.getFreeSlots(5) < 5) {
                npc.say("包裹空間不足，請確保包裹每個欄位有至少 " + 5 + " 格空間");
            } else if (getEventValue("每日完成答題", false) >= 80) {
                setEventValue("答題80獎勵", 1)
                setEventValue("每日完成答題", 1)
                player.gainItem(5060048, 50);//超強勳章
                npc.say("獎勵已發放，請注意查收！");
            } else {
                npc.say("抱歉，您今天還沒有答對80道題目，請繼續努力！");
            }

        } else {
            npc.say("您已經領取過該獎勵！");
        }
    }
}

player.runScript("四選一答題")


function updateDate() {
    date = new Date;
    year = date.getFullYear();
    month = date.getMonth() + 1;
    hour = date.getHours();
    minute = date.getMinutes();
    second = date.getSeconds();
}
//flag = true 查總的不重置
//flag = false 查當天的
function getEventValue(event1, flag) {
    var charInfo = getCharInfo();
    if (flag) {
        var sql = "select sum(value) as numbe from zz_xr_event where accounts_id = " + parseInt(charInfo.accounts_id) + " and event = '" + event1 + "'";
    } else {
        var sql = "select sum(value) as numbe from zz_xr_event where accounts_id = " + parseInt(charInfo.accounts_id) + " and event = '" + event1 + "'AND DATE_FORMAT(time, '%Y-%m-%d') = DATE_FORMAT(NOW(), '%Y-%m-%d') ";
    }
    var resultList = player.customSqlResult(sql);
    var count = 0;
    for (var i = 0; i < resultList.size(); i++) {
        var result = resultList.get(i);
        if (result == null) {
            break;
        }
        count = result.get("numbe");
        if (count == null) {
            count = 0;
        }
    }
    return parseInt(count);
}

function setEventValue(event1, value1) {
    var charInfo = getCharInfo();
    var sql = "insert into zz_xr_event(accounts_id, world, `event`,`value`,time) values(" + charInfo.accounts_id + "," + charInfo.world + ",'" + event1 + "'," + value1 + ",now())";
    player.customSqlInsert(sql);
}

function delEventValue(event1) {
    var charInfo = getCharInfo();
    var sql = "delete from zz_xr_event where accounts_id = " + parseInt(charInfo.accounts_id) + " and event = '" + event1 + "' ";
    player.customSqlUpdate(sql);
}

function getCharInfo() {
    var sql = "SELECT accountid accounts_id,world FROM characters where id = " + player.getId() + "";
    var resultList = player.customSqlResult(sql);
    var charInfo = {};
    for (var i = 0; i < resultList.size(); i++) {
        var result = resultList.get(i);
        if (result == null) {
            break;
        }
        charInfo.accounts_id = result.get("accounts_id");
        charInfo.world = result.get("world");
    }
    return charInfo;
}

