var itemList = Array(
	["\r\n\r\n普通 : \r\n\t", 0],
	//燈飾
	2671001, 2671038, 2671093, 2671115, 2672002, 2672012, 2672058, 2672059, ["\r\n", 0]
	// 窗戶
	, 2671003, 2671010, 2671015, 2671032, 2671051, 2671090, 2671091, 2671092, ["\r\n", 0]
	// 家具
	, 2672014, 2672015, 2672016, 2672017
	, 2672019, 2672020, 2672021, 2672022, 2672023, 2672024, 2672025
	, 2672028, 2672029, 2672030, 2672031, 2672032, 2672033, 2672034
	, 2672035, 2672036, 2672037, 2672038, 2672039
	, 2672040, 2672041, 2672042, 2672043, 2672044
	, 2672061, 2672062, 2672063, 2672064, 2672067
	, 2672068, 2672071, 2672109, 2672110, 2672107
	, 2672098, 2672099, 2672102, 2672121, 2672122
	, 2672123, 2672124, 2672127, 2672129, 2672130
	, 2672131, 2672132, 2672138, 2672139, 2672158
	, 2672160, 2672168, 2672169, 2672170, 2672171
	, ["\r\n", 0]
	// 海報,相框
	, 2671004, 2671005, 2671006, 2671011, 2671012
	, 2671013, 2671014, 2671016, 2671020, 2671021
	, 2671022, 2671023, 2671024, 2671025, 2671026
	, 2671027, 2671028, 2671029, 2671030, 2671031
	, 2671033, 2671034, 2671035, 2671039, 2671040
	, 2671041, 2671042, 2671043, 2671044, 2671045
	, 2671046, 2671047, 2671048, 2671049, 2671050
	, 2671095, 2671096, 2671097, 2671098
	, ["\r\n", 0]
	// 不分類
	, 2671007, 2671000, 2671002, 2671009
	, 2671017, 2671018, 2671036, 2671037, 2671052
	, 2671094, 2671113, 2671114, 2671067
	, 2672008, 2672009, 2672010, 2672018
	, 2672026, 2672027
	, 2672055, 2672057, 2672065, 2672066
	, 2672103, 2672104, 2672105, 2672106
	, 2672125, 2672126, 2672125


	, ["\r\n", 0]



	, ["\r\n\r\n??? : \r\n\t", 0]
	, 2671099, 2671100, 2671101, 2671102, 2671103, 2671104
	, 2671105, 2671106, 2671107, 2671108, 2671109, 2671110, ["\r\n", 0]
	, 2672111, 2672112, 2672113, 2672114, ["\r\n", 0]
	, 2671084, 2671085, 2671086, 2671087, 2671088, ["\r\n", 0]
	, 2672115, 2672116, 2672117, 2672118, 2672119, 2672120, 2671089, ["\r\n", 0]
	, 2671008, 2672054, ["\r\n", 0]
	, 2672140, 2672141, 2672142, 2672143, 2672144, ["\r\n", 0]
	, 2672145, 2672146, 2672147, 2672148, 2672149, ["\r\n", 0]

	, ["\r\n\r\n東方 : \r\n\t", 0]
	// 窗戶
	, 2671068, 2671069, ["\r\n", 0]
	//家具
	, 2672097, 2672100, 2672101, 2672108
	, 2672179, 2672150, 2672096
	, ["\r\n", 0]
	// 海報
	, 2671079, 2671080, 2671081, 2671082, 2671083
	, 2671074, 2671075, 2671076, 2671077, 2671078, ["\r\n", 0]
	// 不分類
	, 2671070, 2671071, 2671072, 2671073, ["\r\n", 0]



	, ["\r\n\r\n萬聖 : \r\n\t", 0]
	, 2671116, ["\r\n", 0]
	// 窗戶
	, 2671059, 2671060, ["\r\n", 0]
	// 海報
	, 2671061, 2671062, 2671063, 2671064, 2671065, 2671066, ["\r\n", 0]
	// 不分類
	, 2671055, 2671056, 2671057, 2671058
	, 2672077, 2672078, 2672079, 2672080, 2672081
	, 2672082, 2672083, 2672084, 2672085, 2672086
	, 2672087, 2672088, 2672089, 2672090, 2672091
	, 2672092, 2672093, 2672094, ["\r\n", 0]

	, ["\r\n\r\n聖誕 : \r\n\t", 0]
	// 聖誕
	, 2671119, ["\r\n", 0]
	// 窗戶
	, 2671121, ["\r\n", 0]
	// 海報
	, 2671124, 2671125, 2671126, 2671127, 2671128, 2671129, ["\r\n", 0]
	// 不分類
	, 2671117, 2671118, 2671120, 2671122, 2671123, 2671130, 2671131
	, 2672095, 2672161, 2672162, 2672163, 2672164, 2672165, 2672166
	, 2672167, 2672151, 2672152, 2672153, 2672154, 2672155, 2672156
	, 2672159
	, 2672157, ["\r\n", 0]

	, ["\r\n\r\nNEO : \r\n\t", 0]
	// NEO
	// 燈飾
	, 2671132, 2671133, ["\r\n", 0]
	// 家具
	, 2672175, 2672176, 2672177, 2672178, ["\r\n", 0]
	// 海報
	, 2671134, ["\r\n", 0]


);

let minPlayers = 1;
let maxPlayers = 6;
let minLevel = [200];
let maxLevel = [300];
let maxenter = [1];

let BossName = "家具副本";
let PQLog = ["家具副本"];
let event = ["家具副本"];
let onlyOne = true;
let warn = true;
let checkLimit = 1000000;
let item = 4310315;	//入場道具
let itemcount = 1;		//消耗數量


var XC01 = "#fUI/NameTag.img/medal/175/w#";// - BURNING(左)
var XC02 = "#fUI/NameTag.img/medal/175/c#";// - BURNING(中)
var XC03 = "#fUI/NameTag.img/medal/175/e#";// - BURNING(右)


var text = "";
text += "\t\t\t     #fs32##b#e#fc0xFFF0F90A#【" + BossName + "】\r\n";
text += "" + XC01;
for (var i = 0; i <= 240; i++) {
	text += XC02;
};
text += XC03 + "\r\n"
text += "#n#fs16##fc0xFF02FC9B#";
text += "人數限制:[" + minPlayers + "-" + maxPlayers + "]  次數限制:[" + player.getEventValue(PQLog) + "/" + maxenter + "] 入場等級:[" + minLevel + "-" + maxLevel + "]\r\n";
text += "#b";
text += "入場消耗: [#i" + item + "#*1]\r\n";
text += "全員獎勵: 家具(下方可瀏覽)\r\n";

text += "\r\n";
text += "#fs17##e\t     ";
for (var i = 0; i < PQLog.length; i++) {
	text += "       #g#fs20##e#L" + i + "#進入" + PQLog[i] + "#l";
}

text += "\r\n\r\n#fs16##fc0xFFF0F90A#";
text += "#L1#瀏覽家具#l";
text += "\r\n";

let sel = npc.askMenuA("" + text, true);

if (sel == 0) {
	if (party == null || player.getId() != party.getLeader()) {
		npc.sayNextS("#fs18##e#b\t  請玩家先創建隊伍\r\n\t #fs14#此副本接受#r[" + minPlayers + "-" + maxPlayers + "]#b人的隊伍\r\n\t  並且等級在#r[" + minLevel[sel] + "-" + maxLevel[sel] + "]#b之間\r\n\t   讓你的隊長和我對話吧!", true);
	} else if (party.numberOfMembersInChannel() < minPlayers || party.getMembersCount(map.getId(), 1, 300) > maxPlayers) {
		npc.sayNextS("#fs17##e#b你需要有一個#r" + minPlayers + "-" + maxPlayers + "#b人的隊伍.!", true);
	} else if (party.getMembersCount(map.getId(), minLevel[sel], maxLevel[sel]) < party.getMembersCount(map.getId(), 1, 300)) {
		npc.sayNextS("#fs17##e#b你隊員的等級要在#r[" + minLevel[sel] + "-" + maxLevel[sel] + "]#b之間!", true);
	} else if (party.numberOfMembersInChannel() < party.getMembersCount()) {
		npc.sayNextS("#fs17##e#b好像你有隊員在其他地方,請把隊員都召集到這裡!");
	} else if (party.getNotHasItemMember(item, itemcount)) {
		npc.sayNext("#fs14##b隊伍中有人#v" + item + "#不足.", true);
	}/* else if (!party.isAllMembersAllowedPQ(PQLog[sel], maxenter[sel])) {
                npc.sayNextS("#fs17##e#b你隊員#r[" + party.getNotAllowedMember(PQLog[sel], maxenter[sel]) + "]#b次數已經達到上限了。", true);
        }*/ else if (npc.makeEvent(event[sel], onlyOne, party) == null) {
		npc.sayNextS("#fs17##e#b已經有隊伍在進行了,請更換其他頻道嘗試。", true);
	}
	if (warn) {
		//進場通知
		// npc.broadcastPlayerNotice(49,"【"+BossName+"】 " + player.getName() + " 帶領成員進入！！");

	}
}


if (sel == 1) {
	txt = "#b家具:#k\r\n";
	// txt += " 未新增";

	for (var i = 0; i < itemList.length; i++) {
		if (itemList[i][1] != null) {
			txt += "" + itemList[i][0] + "";
		} else {
			txt += "#i" + itemList[i] + "#";
		}
	}
	npc.sayS(txt, true);
}