var a = 0;
var text;
var selects; //記錄玩家的1選項
var buynum = 0;
var itemlist = Array(
    Array(2434228, 20000, ""),//S級潛能附加捲軸 80%
    Array(2434229, 20000, ""),//S級潛能附加捲軸 80%
    Array(2049750, 20000, ""),//S級潛能附加捲軸 80%

    Array(2049406, 8888, ""),//特殊潛能附加捲軸
    Array(2048307, 8888, ""),//特殊附加潛能附加捲軸
    Array(2049506, 8888, ""),//完美刻印之印
    Array(2048212, 8888, ""),//完美附加刻印之印

    Array(5062500, 10000, ""),//大師附加神奇魔方
    Array(2710000, 10000, ""),//可疑的方塊"),
    Array(5062017, 10000, ""),//閃耀方塊"),
    Array(5062020, 10000, ""),//閃炫方塊"),
    Array(5062009, 10000, ""),//閃炫方塊"),
    Array(5062019, 50000, ""),//閃炫方塊"),
    Array(5743003, 10000, ""),//怪怪方塊
    Array(3090006, 50000, ""),//拼圖盒子
    Array(5537000, 10000, ""),//怪怪卡包
    Array(5062800, 5000, ""),//奇幻傳播者"),
    Array(2470003, 50000, ""),//黃金鐵鎚100%"),

    Array(2430913, 10000, ""),//黃金鐵鎚100%"),
    Array(2431272, 10000, ""),//黃金鐵鎚100%"),
    Array(2893001, 10000, ""),//黃金鐵鎚100%"),
    Array(3994895, 10000, ""),//黃金鐵鎚100%"),
    Array(2049119, 5000, ""),//黃金鐵鎚100%"),
    Array(5370000, 500, ""),
    Array(2040727, 50000, ""),
    Array(4001832, 500, ""),
    Array(2500000, 2000, ""),
    Array(2501000, 5000, ""),
    Array(2049627, 50000, ""),
    Array(2650010, 50000, ""),
    Array(5044010, 100000, ""),
    Array(2051000, 100000, ""),

    Array(3080016, 50000, ""),//楓點商店-實用雜物專區[偉大的變身之藥]"),
    Array(5156000, 50000, ""),//楓點商店-實用雜物專區[偉大的變身之藥]"),
    Array(5192000, 20000, ""),//楓點商店-實用雜物專區[寵物強化箱]"),
    Array(2435122, 10000, ""),//楓點商店-實用雜物專區[傷害字型儲存欄位 1欄擴充券]"),
    Array(5520000, 20000, ""),//楓點商店-實用雜物專區[神奇剪刀]"),
    Array(5520001, 20000, ""),//楓點商店-實用雜物專區[白金神奇剪刀]"),
    Array(5520003, 20000, ""),//楓點商店-實用雜物專區[寵物神奇剪刀]"),
    Array(5520002, 20000, ""),//楓點商店-實用雜物專區[時裝神奇剪刀]"),
    Array(5133000, 10000, ""),//楓點商店-實用雜物專區[凍結加持器]"),
    Array(5130000, 10000, ""),//楓點商店-實用雜物專區[護身符]"),
    Array(5192000, 20000, ""),//楓點商店-實用雜物專區[寵物強化箱]"),
    Array(2432318, 20000, ""),//楓點商店-實用雜物專區[寵物技能組]"),
    Array(5190010, 20000, ""),//楓點商店-實用雜物專區[寵物加持技能]"),
    Array(5170000, 10000, ""),//楓點商店-實用雜物專區[取寵物名]"),
    Array(5700000, 10000, ""),//楓點商店-實用雜物專區[機器人取名券]"),    
    Array(5155005, 10000, ""),//楓點商店-實用雜物專區[卡勒塔的珍珠]"),
    Array(5800000, 25000, ""),//楓點商店-實用雜物專區[甜心魔粉餅]"),
    Array(5800001, 25000, ""),//楓點商店-實用雜物專區[花樣魔粉餅]"),
    Array(5800002, 25000, ""),//楓點商店-實用雜物專區[魅力魔粉餅]"),
    Array(2350004, 20000, ""),//楓點商店-實用雜物專區[凱薩型態變色]"),
    Array(2432946, 30000, ""),//楓點商店-實用雜物專區[自定義混色染髮券]"),
    Array(5152300, 30000, ""),//楓點商店-實用雜物專區[自定義混色瞳孔變色券]"),
    Array(5860000, 50000, ""),//楓點商店-實用雜物專區[染色顏料]"),
    Array(5860001, 50000, ""),//楓點商店-實用雜物專區[還原顏料]"),
    Array(5860002, 50000, ""),//楓點商店-實用雜物專區[自定義顏料]"),
    Array(5062400, 30000, ""),//楓點商店-實用雜物專區[神秘鐵砧]"),
    Array(5062402, 30000, ""),//楓點商店-實用雜物專區[勳章的神秘鐵鉆]"),
    Array(5062404, 30000, ""),//楓點商店-實用雜物專區[時裝神秘鐵砧]"),
    Array(5155002, 20000, ""),//楓點商店-實用雜物專區[透明傑諾印記]"),
    Array(5155003, 20000, ""),//楓點商店-實用雜物專區[透明魔族的標識]"),
    Array(5155006, 20000, ""),//楓點商店-實用雜物專區[深淵的洗禮]"),
    Array(2892000, 20000, ""),//楓點商店-實用雜物專區[透明機器人耳飾感應器]"),
    Array(5155001, 20000, ""),//楓點商店-實用雜物專區[透明凱薩尾巴]"),
    Array(5012001, 20000, ""),//楓點商店-實用雜物專區[透明幻獸師尾]"),
    Array(5012000, 20000, ""),//楓點商店-實用雜物專區[透明幻獸師耳朵]"),
    Array(5680531, 20000, ""),//楓點商店-實用雜物專區[髮型欄位擴充券]"),
    Array(5680733, 20000, ""),//楓點商店-實用雜物專區[整形欄位擴充券]"),
    Array(5680889, 20000, "")//楓點商店-實用雜物專區[皮膚欄位擴充券]"),

    /*Array(5152111, 5000, ""),//日拋眼睛"),
    Array(5370000, 500, "")*/



);


hgggg1();

function hgggg1() {


    text = "#fs21##e#r你好,這裡是楓點商店\r\n\r\n#b";//
    for (var i = 0; i < itemlist.length; i++) {
        text += "#fs16##b#e#L" + i + "##v" + itemlist[i][0] + "# #b#z" + itemlist[i][0] + "#  價格#r" + itemlist[i][1] + " #b楓點" + itemlist[i][2] + "\r\n";
        if (i != 0 && (i + 1) % 5 == 0) {
            text += "\r\n";
        }
    }
    let selection = npc.askMenuA(text);

    selects = selection;
    buynum = npc.askNumber("#r警#g告：#b請注意揹包空位夠不夠，請注意(有些物品是1個物品佔1個格子哦)!\r\n#r警#g告：#b如果空位不夠，購買的物品將消失，不給與任何賠償!\r\n\r\n#k#d請輸入你請你輸入想要購買的數量\r\n#r#e1個#i" + itemlist[selects][0] + "#需要" + itemlist[selects][1] + "楓點", 1, 1, 10000);
    npc.sayNext("你想購買" + buynum + "個#r#i" + itemlist[selects][0] + "##k？\r\n你將使用掉" + (buynum * (itemlist[selects][1])) + "楓點。");

    if (player.getCashShopCurrency(2) >= buynum * (itemlist[selects][1]) && player.canGainItem(itemlist[selects][0], buynum)) {
        player.modifyCashShopCurrency(2, -buynum * (itemlist[selects][1]));
        player.gainItem(itemlist[selects][0], buynum);
        player.dropMessage(2, "扣除楓點 " + buynum * (itemlist[selects][1]) + "");
        //npc.broadcastNoticeWithoutPrefix("玩家 " + player.getName() + " 在楓點商店購買了" + buynum + "個" + player.makeItemWithId(itemlist[selects][0]).getItemName() + "。");
        npc.say("購買成功了！");
    } else {
        npc.say("失敗：\r\n1). 揹包欄位已滿,請清理 \r\n2). 你沒有足夠的楓點。");

    }
    hgggg1();
}