
var itemList = Array(

	//通用心臟
	/*Array(1662172, 1000, 1, 0),	//野花精靈機器人
	Array(1662171, 1000, 1, 0),	//層層貓貓蟲咖波機器人
	Array(1662175, 1000, 1, 0),	//超級巨星皮卡啾機器人
	Array(1662168, 1000, 1, 0),	//溫莉機器人
	Array(1662173, 1000, 1, 0),	//姆嗚機器人
	Array(1662167, 1000, 1, 0),	//石之精靈機器人
	Array(1662114, 10000, 1, 0),	//麥吉機器人
	Array(1662134, 10000, 1, 0),	//明日香設計機器人
	Array(1662135, 10000, 1, 0),	//綾波零設計機器人
	Array(1662030, 10000, 1, 0),	//戰國時代機器人(男)
	Array(1662031, 10000, 1, 0),	//戰國時代機器人(女)
	Array(1662035, 10000, 1, 0),	//神之子阿爾法機器人
	Array(1662036, 10000, 1, 0),	//神之子蓓塔機器人
	Array(1662039, 10000, 1, 0),	//殺人鯨機器人
	Array(1662041, 10000, 1, 0),	//萬聖節裝飾
	Array(1662043, 10000, 1, 0),	//隱月機器人(男)
	Array(1662044, 10000, 1, 0),	//隱月機器人(女)
	Array(1662046, 10000, 1, 0),	//姆勒姆勒機器人
	Array(1662053, 5000, 1, 0),	//史烏機器人
	Array(1662064, 10000, 1, 0),	//那因哈特機器人(男)
	Array(1662065, 10000, 1, 0),	//伊卡勒特機器人(男)
	Array(1662066, 10000, 1, 0),	//西格諾斯機器人(女)
	Array(1662067, 10000, 1, 0),	//伊麗娜機器人(女)
	Array(1662077, 10000, 1, 0),	//涼爽機器人
	Array(1662082, 10000, 1, 0),	//妖精機器人(男)
	Array(1662083, 10000, 1, 0),	//妖精機器人(女)
	Array(1662088, 5000, 1, 0),	//戴米安機器人
	Array(1662089, 5000, 1, 0),	//愛麗西亞機器人
	Array(1662090, 10000, 1, 0),	//舒班尼機器人
	Array(1662091, 10000, 1, 0),	//珍博士機器人
	Array(1662107, 10000, 1, 0),	//夢布朗機器人
	Array(1662108, 10000, 1, 0),	//布丁機器人
	Array(1662109, 10000, 1, 0),	//秀機器人
	Array(1662110, 10000, 1, 0),	//派伊機器人
	Array(1662111, 5000, 1, 0),	//露希妲機器人
	Array(1662115, 10000, 1, 0),	//嬌小機器人(男)
	Array(1662116, 10000, 1, 0),	//嬌小機器人(女)
	Array(1662125, 10000, 1, 0),	//妖精機器人(男)
	Array(1662126, 10000, 1, 0),	//妖精機器人(女)
	Array(1662127, 10000, 1, 0),	//閃亮蝴蝶機器人(男)
	Array(1662128, 10000, 1, 0),	//閃亮蝴蝶機器人(女)
	Array(1662130, 10000, 1, 0),	//死亡機器人(男)
	Array(1662131, 10000, 1, 0),	//死亡機器人(女)
	Array(1662139, 10000, 1, 0),	//糖果機器人
	Array(1662140, 5000, 1, 0),	//真‧希拉機器人
	Array(1662141, 10000, 1, 0),	//聯盟司令官西格諾斯機器人
	Array(1662145, 1000, 1, 0),	//武公機器人
	Array(1662147, 5000, 1, 0),	//愛麗西亞機器人
	Array(1662148, 5000, 1, 0),	//威爾機器人
	Array(1662149, 5000, 1, 0),	//新復古愛麗西亞機器人
	Array(1662150, 5000, 1, 0),	//新復古露希妲機器人
	Array(1662151, 5000, 1, 0),	//新復古戴米安機器人
	Array(1662152, 5000, 1, 0),	//賽蓮機器人
	Array(1662154, 10000, 1, 0),	//幽靡機器人
	Array(1662155, 10000, 1, 0),	//萬聖貓機器人
	Array(1662156, 10000, 1, 0),	//拉尼亞機器人
	Array(1662160, 10000, 1, 0),	//萊爾普機器人
	Array(1662161, 10000, 1, 0),	//洛尼機器人
	Array(1662162, 10000, 1, 0),	//米斯媞機器人
	Array(1662163, 10000, 1, 0),	//梅利爾機器人
	Array(1662164, 10000, 1, 0),	//時間機器人(男)
	Array(1662165, 10000, 1, 0),	//時間機器人(女)
	Array(1662166, 10000, 1, 0),	//莉琳機器人
	Array(1662169, 10000, 1, 0),	//露奈機器人
	Array(1662170, 10000, 1, 0),	//里奧機器人
	Array(1666000, 10000, 1, 0),	//女僕機器人

	/*
	1666002,//初音未來機器人
	1666003,//鏡音鈴機器人
	1666004,//鏡音連機器人
	1666005,//KAITO機器人
	1662136,//初號機造型機器人
	1662112,//拉姆機器人
	1662113,//雷姆機器人
	/*
	/*
	1662117,//華麗機器人瑪倫
	1662118,//華麗機器人艾波麗
	1662119,//華麗機器人史嘉莉
	1662120,//華麗機器人安柏
	1662121,//華麗機器人希弗
	1662122,//華麗機器人波隆茲
	1662123,//華麗機器人托弗
	1662123,//華麗機器人京傑
	1672078,//華麗機器人專用心臟
	
	
	1662174,//菇菇機器人
	1672091,//菇菇機器人專用心臟
	*/



);


let now = player.getEventValue("機器人獎勵");
let max = 200;//最大領獎次數


if (max > now) {
	/*chance = Math.floor(Math.random() * 10000);
	finalitem = Array();
	for (var i = 0; i < itemList.length; i++) {
		if (itemList[i][1] >= chance) {
			finalitem.push(itemList[i]);
		}
	}

	random = new java.util.Random();
	finalchance = random.nextInt(finalitem.length);
	itemId1 = itemList[finalchance][0];
	quantity1 = itemList[finalchance][2];

	let newItem = player.makeItemWithId(itemId1);
	// newItem.setAttribute(1080);
	player.gainItem(newItem);
	// npc.broadcastPlayerNotice(0xC,"消滅了怪物，獲取：\r\n "+player.makeItemWithId(itemId).getItemName()+" x1！！");

	qqq = 3;
	qs1 = Math.floor(Math.random() * 10000);
	qs2 = Math.floor(Math.random() * 10000);
	if (qs1 < 7500) {
		qqq += 1;
	}
	if (qs1 < 5000) {
		qqq += 1;
	}
	if (qs1 < 4000) {
		qqq += 1;
	}
	if (qs1 < 3000) {
		qqq += 1;
	}
	if (qs1 < 2000) {
		qqq += 1;
	}
	if (qs1 < 500) {
		qqq += 1;
	}
	if (qs1 < 50) {
		qqq += 1;
	}
	/*let tt = party.getMembersCount(map.getId(), 1, 300);
	/*if (tt >= 3) {
		/*partycount = 1.5;
	} else {
		partycount = 1;
	}*/
	//player.dropMessage(6, "隊伍人數 " + tt + " , 加成 " + partycount + "倍");
	player.gainItem(2633336, 50);
	player.addEventValue("機器人獎勵", 1, 1);
	player.addEventValue("機器人獎勵總次數", 1, 999);
   npc.broadcastPlayerNotice(1, "【風雨森林】:玩家 " + player.getName() + " 今日已成功通關任務" + (now + 1) + "次,獲得大量獎勵！");

} else {
	player.showSystemMessage("今日已經領取了" + max + "次獎勵,無法再次領取");
}


