
var itemList = Array(
	//鞭
	1302013, 1302061, 1302049, 1302080,
	1302088, 1302160, 1302161, 1302162,
	//雨傘
	1302016, 1302017, 1302025, 1302026, 1302027, 1302028,
	1302029, 1302058, 1302180,
	//泳圈
	1302358, 1322021, 1322022, 1322023, 1322024, 1322025,
	1322026,
	//槌子
	1402257, 1402258, 1302021,
	//滑雪板雙
	1432015, 1432016, 1432017, 1432018,
	//滑雪板
	1442011, 1442012, 1442013, 1442014, 1442015, 1442016,
	1442017, 1442026, 1442027, 1442028, 1442029, 1442030,
	1442046, 1442054, 1442055, 1442056, 1442057,
	//花
	1442050, 1442121, 1442122, 1442123,
	//蛋糕火柴
	1302084, 1302085, 1302129,
	//香菇
	1382016, 1382015,
	1442039, 1442068, 1442106, 1442025,
	//復古
	1302357, 1402270,
	//球棒8+9
	1402009, 1402010,
	//畫筆
	1312013, 1312014,
	//仙女棒
	1472081, 1472098,
	1302087, 1302022, 1302024, 1302031, 1302063, 1302102, 1382261,
	1302105, 1302132, 1302150, 1312012, 1322003, 1322012, 1322013, 1322027, 1322031, 1322033, 1322034, 1322051, 1322070, 1322102, 1322225, 1322269, 1332020, 1332021, 1332029, 1332030, 1332032, 1332048, 1332053, 1332101, 1372017, 1372033, 1372221, 1382038, 1402013, 1402014, 1402029, 1402038, 1402044, 1402110, 1402178, 1402230, 1422036, 1422068, 1422160, 1402037,
	//屍體
	1442277,


);


let now = player.getEventValue("玩具獎勵");
let max = 2;//最大領獎次數


if (max > now) {
	chance = Math.floor(Math.random() * 10000);
	finalitem = Array();
	for (var i = 0; i < itemList.length; i++) {
		if (itemList[i][1] >= chance) {
			finalitem.push(itemList[i]);
		}
	}

	random = new java.util.Random();
	finalchance = new java.util.Random().nextInt(itemList.length);
	itemId1 = itemList[finalchance];

	let newItem = player.makeItemWithId(itemId1);
	// newItem.setAttribute(1080);
	player.gainItem(newItem);
	// npc.broadcastPlayerNotice(0xC,"消滅了怪物，獲取：\r\n "+player.makeItemWithId(itemId).getItemName()+" x1！！");

	player.addEventValue("玩具獎勵", 1, 1);
	player.addEventValue("玩具獎勵總次數", 1, 999);


} else {
	player.showSystemMessage("今日已經領取了" + max + "次獎勵,無法再次領取");
}