var status = -1
var txt;
/*------------------------------------------------------------*/
//var GC1 = "#fEffect/CharacterEff/1050312/0/0#"; //最上面的亮粉
//var GC2 = "#fUI/UIMiniGame/starPlanetRPS/heart#"; //紅心桃心
var GC3 = "#fEffect/CharacterEff/1082700/1/0#"; //"+z+"//小選項用
var items = Array(Array(1402114, 500000, 1, "玩具"),
    Array(1003409, 1000000, 1, "玩具"),
    Array(1002728, 1000000, 1, "玩具"),
    Array(1003055, 1000000, 1, "玩具"),
	 Array(2634513, 1000000, 1, "玩具"),
	 Array(2634513, 1000000, 1, "玩具"),
    Array(1003570, 1000000, 1, "玩具"),
    Array(1004057, 1000000, 1, "玩具"),
    Array(1003359, 1000000, 1, "玩具"),
    Array(1012291, 1000000, 1, "玩具"),
    Array(1012532, 1000000, 1, "玩具"),
    Array(1012073, 1000000, 1, "玩具"),
    Array(1012070, 1000000, 1, "玩具"),
    Array(1042244, 1000000, 1, "玩具"),
    Array(1082219, 1000000, 1, "玩具"),
    Array(1062158, 1000000, 1, "玩具"),
    Array(1072345, 1000000, 1, "玩具"),
    Array(1052532, 1000000, 1, "玩具"),
    Array(1052472, 1000000, 1, "玩具"),
    Array(1082719, 1000000, 1, "玩具"),
    Array(1082453, 1000000, 1, "玩具"),
    Array(1102777, 1000000, 1, "玩具"),
    Array(1032055, 1000000, 1, "玩具"),
    Array(1072275, 1000000, 1, "玩具"),
    Array(1402037, 1000000, 1, "玩具"),
    Array(1402180, 1000000, 1, "玩具"),
    Array(1382037, 1000000, 1, "玩具"),
    Array(1332112, 1000000, 1, "玩具"),
    Array(1402214, 1000000, 1, "玩具"),
    Array(1332101, 1000000, 1, "玩具"),
    Array(1432182, 1000000, 1, "玩具"),
    Array(1422156, 1000000, 1, "玩具"),
    Array(1382226, 1000000, 1, "玩具"),
    Array(1452220, 1000000, 1, "玩具"),
    Array(1462208, 1000000, 1, "玩具"),
    Array(1472230, 1000000, 1, "玩具"),
    Array(1332242, 1000000, 1, "玩具"),
    Array(1342087, 1000000, 1, "玩具"),
    Array(1492194, 1000000, 1, "玩具"),
    Array(1482183, 1000000, 1, "玩具"),
    Array(1532112, 1000000, 1, "玩具"),
    Array(1032235, 1000000, 1, "玩具"),
    Array(1232019, 1000000, 1, "玩具"),
    Array(1332153, 1000000, 1, "玩具"),
    Array(1342042, 1000000, 1, "玩具"),
    Array(1382127, 1000000, 1, "玩具"),
    Array(1402114, 1000000, 1, "玩具"),
    Array(1452132, 1000000, 1, "玩具"),
    Array(1472245, 1000000, 1, "玩具"),
    Array(1472050, 1000000, 1, "玩具"),
    Array(1003413, 1000000, 1, "玩具"),
    Array(1003219, 1000000, 1, "玩具"),
    Array(1002934, 1000000, 1, "玩具"),
    Array(1002869, 1000000, 1, "玩具"),
    Array(1002799, 1000000, 1, "玩具"),
    Array(1002872, 1000000, 1, "玩具"),
    Array(1003769, 1000000, 1, "玩具"),
    Array(1003526, 1000000, 1, "玩具"),
    Array(1002787, 1000000, 1, "玩具"),
    Array(1002788, 1000000, 1, "玩具"),
    Array(1051404, 1000000, 1, "玩具"),
    Array(1051403, 1000000, 1, "玩具"),
    Array(1051401, 1000000, 1, "玩具"),
    Array(1052217, 1000000, 1, "玩具"),
    Array(1052444, 1000000, 1, "玩具"),
    Array(1052208, 1000000, 1, "玩具"),
    Array(1102134, 1000000, 1, "玩具"),
    Array(1102143, 1000000, 1, "玩具"),
    Array(1102145, 1000000, 1, "玩具"),
    Array(1102147, 1000000, 1, "玩具"),
    Array(1102198, 1000000, 1, "玩具"),
    Array(1102234, 1000000, 1, "玩具"),
    Array(1102173, 1000000, 1, "玩具"),
    Array(1102241, 1000000, 1, "玩具"),
    Array(1102100, 1000000, 1, "玩具"),
    Array(1102099, 1000000, 1, "玩具"),
    Array(1102046, 1000000, 1, "玩具"),
    Array(1102047, 1000000, 1, "玩具"),
    Array(1102348, 1000000, 1, "玩具"),
    Array(1102716, 1000000, 1, "玩具"),
    Array(1082264, 1000000, 1, "玩具"),
    Array(1082392, 1000000, 1, "玩具"),
    Array(1082393, 1000000, 1, "玩具"),
    Array(1082394, 1000000, 1, "玩具"),
    Array(1082533, 1000000, 1, "玩具"),
    Array(1012076, 1000000, 1, "玩具"),
    Array(1012077, 1000000, 1, "玩具"),
    Array(1012078, 1000000, 1, "玩具"),
    Array(1012079, 1000000, 1, "玩具"),
    Array(1012081, 1000000, 1, "玩具"),
    Array(1012158, 1000000, 1, "玩具"),
    Array(1012416, 1000000, 1, "玩具"),
    Array(1012417, 1000000, 1, "玩具"),
    Array(1012418, 1000000, 1, "玩具"),
    Array(1012419, 1000000, 1, "玩具"),
    Array(1012540, 1000000, 1, "玩具"),
    Array(1012541, 1000000, 1, "玩具"),
    Array(1012542, 1000000, 1, "玩具"),
    Array(1012543, 1000000, 1, "玩具"),
    Array(1022193, 1000000, 1, "玩具"),
    Array(1022153, 1000000, 1, "玩具"),
    Array(1003091, 1000000, 1, "玩具"),
    Array(1332177, 1000000, 1, "玩具"),
    Array(1332030, 1000000, 1, "玩具"),
    Array(1332048, 1000000, 1, "玩具"),
    Array(1332054, 1000000, 1, "玩具"),
    Array(1292006, 1000000, 1, "玩具"),
    Array(1332063, 1000000, 1, "玩具"),
    Array(1040014, 1000000, 1, "玩具"),
    Array(1102041, 1000000, 1, "玩具"),
    Array(1102084, 1000000, 1, "玩具"),
    Array(1082149, 1000000, 1, "玩具"),
    Array(1072001, 1000000, 1, "玩具"),
    Array(1012011, 1000000, 1, "玩具"),
    Array(1012056, 1000000, 1, "玩具"),
    Array(1022047, 1000000, 1, "玩具"),
    Array(1022058, 1000000, 1, "玩具"),
    Array(1022060, 1000000, 1, "玩具"),
    Array(1022067, 1000000, 1, "玩具"),
    Array(1032003, 1000000, 1, "玩具"),
    Array(1032027, 1000000, 1, "玩具"),
    Array(1032077, 1000000, 1, "玩具"),
    Array(1032078, 1000000, 1, "玩具"),
    Array(1032079, 1000000, 1, "玩具"),
    Array(1032183, 1000000, 1, "玩具"),
    Array(1032017, 1000000, 1, "玩具"),
    Array(1332025, 1000000, 1, "玩具"),
    Array(1382016, 1000000, 1, "玩具"),
    Array(1472032, 1000000, 1, "玩具"),
    Array(1472054, 1000000, 1, "玩具"),
    Array(1002905, 1000000, 1, "玩具"),
    Array(1002906, 1000000, 1, "玩具"),
    Array(1003391, 1000000, 1, "玩具"),
    Array(1003571, 1000000, 1, "玩具"),
    Array(1003579, 1000000, 1, "玩具"),
    Array(1003610, 1000000, 1, "玩具"),
    Array(1003635, 1000000, 1, "玩具"),
    Array(1003693, 1000000, 1, "玩具"),
    Array(1003692, 1000000, 1, "玩具"),
    Array(1003999, 1000000, 1, "玩具"),
    Array(1003981, 1000000, 1, "玩具"),
    Array(1004013, 1000000, 1, "玩具"),
    Array(1004650, 1000000, 1, "玩具"),
    Array(1042227, 1000000, 1, "玩具"),
    Array(1042352, 1000000, 1, "玩具"),
    Array(1042353, 1000000, 1, "玩具"),
    Array(1042283, 1000000, 1, "玩具"),
    Array(1062143, 1000000, 1, "玩具"),
    Array(1072073, 1000000, 1, "玩具"),
    Array(1072074, 1000000, 1, "玩具"),
    Array(1072075, 1000000, 1, "玩具"),
    Array(1072077, 1000000, 1, "玩具"),
    Array(1072087, 1000000, 1, "玩具"),
    Array(1072099, 1000000, 1, "玩具"),
    Array(1072100, 1000000, 1, "玩具"),
    Array(1072223, 1000000, 1, "玩具"),
    Array(1072264, 1000000, 1, "玩具"),
    Array(1072455, 1000000, 1, "玩具"),
    Array(1072872, 1000000, 1, "玩具"),
    Array(1072991, 1000000, 1, "玩具"),
    Array(1073071, 1000000, 1, "玩具"),
    Array(1073414, 1000000, 1, "玩具"),
    Array(1073423, 1000000, 1, "玩具"),
    Array(1082232, 1000000, 1, "玩具"),
    Array(1082453, 1000000, 1, "玩具"),
    Array(1082533, 1000000, 1, "玩具"),
    Array(1082719, 1000000, 1, "玩具"),
    Array(1002106, 1000000, 1, "玩具"),
    Array(1002163, 1000000, 1, "玩具"),
    Array(1002289, 1000000, 1, "玩具"),
    Array(1012291, 1000000, 1, "玩具"),
    Array(1012341, 1000000, 1, "玩具"),
    Array(1012346, 1000000, 1, "玩具"),
    Array(1012574, 1000000, 1, "玩具"),
    Array(1012576, 1000000, 1, "玩具"),
    Array(1012577, 1000000, 1, "玩具"),
    Array(1012586, 100000, 1, "玩具"),
    Array(1012587, 1000000, 1, "玩具"),
    Array(1022150, 1000000, 1, "玩具"),
    Array(1032013, 1000000, 1, "玩具"),
    Array(1032016, 1000000, 1, "玩具"),
    Array(1032017, 1000000, 1, "玩具"),
    Array(1032061, 1000000, 1, "玩具"),
    Array(1032129, 1000000, 1, "玩具"),
    Array(1032226, 1000000, 1, "玩具"),
    Array(1032227, 1000000, 1, "玩具")

);

//txt = "" + GC1 + GC1 + GC1 + GC1 + "\r\n";
txt = "\r\n";
txt += "\t\t\t#e#fs20##fc0xFFFF4EFF#【玩具商店】\r\n#n";
txt += "#fs12##b該商店賣的是無屬性玩具只有名字[裝備的神秘鐵鉆]\r\n#n";
txt += "#fs12##b本功能由玩家提供的代碼,沒經過測試\r\n#n";
txt += "#fs12##b如果買的神秘鐵鉆鉆不了就換別的,屬於正常現象\r\n#n";

//txt += "" + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + GC2 + "";
txt += "#fs12##b";
for (var i = 1; i < items.length; i++) {
    txt += "#L" + i + "##b#e#v" + items[i][0] + "# #k" + items[i][3] + "#b #r" + items[i][1] + " #b楓點#n\r\n";
}
let selection = npc.askMenu(txt, 9062453);
i = selection;
selection = npc.askNumber("購買道具為：#v" + items[i][0] + "# #z" + items[i][0] + "##k\r\n請輸入購買個數：", 1, 1, 1);

if (i) {
    GS = selection;
    QSS = GS * items[i][1];
    if (player.getCashShopCurrency(2) < QSS) {
        npc.say("#fs16##b#e楓葉點數不足，無法購買");
    } else {
        player.showSystemMessage("消耗 [ " + (QSS) + " ] 楓點");
        player.modifyCashShopCurrency(2, -QSS);
        let newItem = player.makeItemWithId(items[i][0]);
        newItem.setStr(0);
        newItem.setDex(0);
        newItem.setInt(0);
        newItem.setLuk(0);
        newItem.setMaxHp(0);
        newItem.setMaxMp(0);
        newItem.setPad(0);
        newItem.setMad(0);
        newItem.setBossDamageR(0);
        newItem.setIgnorePDR(0);
        newItem.setDamR(0);
        newItem.setRUC(0);
        player.gainItem(newItem);
        npc.say("#fs16##b#e購買成功");
    }
}
