/**
* 箱子抽取道具 
**/

//抽的物品
let items = Array(
		2630381,
		2630753,
		2439337,
		2439395,
		2438312,
		2434601,
		2432131,
		2432154,
		2432207,
		2432354,
		2432465,
		2432532,
		2432591,
		2432592,
		2432603,
		2432640,
		2432695,
		2432710,
		2432748,
		2432749,
		2432804,
		2432836,
		2433038,
		2433063,
		2433104,
		2433112,
		2433178,
		2433182,
		2433183,
		2433184,
		2433197,
		2433362,
		2433558,
		2433568,
		2433569,
		2433570,
		2433571,
		2433572,
		2433587,
		2433588,
		2433631,
		2433715,
		2433775,
		2433776,
		2433777,
		2433804,
		2433828,
		2433829,
		2433830,
		2433831,
		2433832,
		2433833,
		2433833,
		2433913,
		2433980,
		2433981,
		2433990,
		2434081,
		2434147,
		2434157,
		2434273,
		2434274,
		2434289,
		2434374,
		2434375,
		2434390,
		2434391,
		2434519,
		2434528,
		2434529,
		2434530,
		2434542,
		2434544,
		2434545,
		2434546,
		2434566,
		2434574,
		2434575,
		//2434301,
		//2434319,
		2434654,
		2434655,
		2434658,
		2434659,
		2434661,
		2434663,
		2434710,
		2434734,
		2434817,
		2434818,
		2434824,
		2434868,
		2434873,
		2434875,
		2434877,
		2434879,
		2434950,
		2434951,
		2435027,
		2435030,
		2435037,
		2435043,
		2435044,
		2435046,
		2435047,
		2435140,
		2435141,
		2435157,
		2435158,
		2435159,
		2435162,
		2435166,
		2435179,
		2435184,
		2435193,
		2435196,
		2435213,
		2435222,
		2435316,
		2435335,
		2435336,
		2435356,
		2435357,
		2435358,
		2435408,
		2435424,
		2435425,
		2435427,
		2435428,
		2435433,
		2435486,
		2435487,
		2435488,
		2435489,
		2435542,
		2435543,
		2435544,
		2435545,
		2435546,
		2435548,
		2435549,
		2435565,
		2435566,
		2435567,
		2435568,
		2435673,
		2435674,
		2435802,
		2435905,
		2435906,
		2435907,
		2435908,
		2435948,
		2435949,
		2435950,
		2435951,
		2435952,
		2435953,
		2435954,
		2435955,
		2435956,
		2435957,
		2435972,
		2436023,
		2436024,
		2436026,
		2436027,
		2436028,
		2436029,
		2436132,
		2436133,
		2436134,
		//2436136,
		2436227,
		2436228,
		2436229,
		2436230,
		2436258,
		2436259,
		2436268,
		2436300,
		2436323,
		2436400,
		2436474,
		2436475,
		2436476,
		2436477,
		2436478,
		2436479,
		2436522,
		2436528,
		2436529,
		2436553,
		2436560,
		2436563,
		2436578,
		2436643,
		2436644,
		2436645,
		2436646,
		2436651,
		2436652,
		2436653,
		2436654,
		2436655,
		2436656,
		2436657,
		2436658,
		2436681,
		2436682,
		2436740,
		2436741,
		2436742,
		2436743,
		2436744,
		2436745,
		2436746,
		2436747,
		2436748,
		2436749,
		2436766,
		2436808,
		2436830,
		2436831,
		2436832,
		2436984,
		2436986,
		2437005,
		2437049,
		2437050,
		2437051,
		2437052,
		2437166,
		2437167,
		2437168,
		2437169,
		2437190,
		2437268,
		2437269,
		2437270,
		2437271,
		2437274,
		2437484,
		2437485,
		2437488,
		2437489,
		2437490,
		2437491,
		2437521,
		2437522,
		2437523,
		2437524,
		2437696,
		2437697,
		2437700,
		2437701,
		2437702,
		2437703,
		2437707,
		2437708,
		2437709,
		2437710,
		2437711,
		2437712,
		2437768,
		2437769,
		2437856,
		2438085,
		2438086,
		2438087,
		2438088,
		2438089,
		2438095,
		2438347,
		2438348,
		2438467,
		2438469,
		2438471,
		2438473,
		2438477,
		2438592,
		2438594,
		2438596,
		2438655,
		2438929,
		2438930,
		2438931,
		2439129,
		2439132,
		2439157,
		2439164,
		2439167,
		2439373,
		2439376,
		2439442,
		2439523,
		2439551,
		2439554,
		2439697,
		2439700,
		2439711,
		2439800,
		2439805,
		2439894,
		2439897,
		2630153,
		2630156,
		2630301,
		2630304,
		3801002,
		2432526,
		
		









3018300, //可妮兔沙發
3018301, //布朗熊沙發
3018302, //丘可沙發沙發
3018303, //蛙裡奧沙發
3010007, //粉色海豹靠墊
3010008, //藍色海豹靠墊
3010010, //白色海豹靠墊
3010012, //劍士寶座
3010019, //壽司椅
3010021, //暖暖桌
3010024, //玩具粉熊椅
3010026, //惡靈附身的娃娃椅子
3010028, //海盜的俘虜
3010029, //藍環凳
3010030, //黑環凳
3010031, //紅環凳
3010032, //黃環凳
3010033, //綠環凳
3010034, //悠長假期(紅色)
3010035, //悠長假期(藍色)
3010036, //浪漫秋千
3010037, //豬豬凳
3010038, //空氣沙發
3010039, //黑色海狗靠墊
3010040, //蝙蝠椅
3010041, //骷髏王座
3010043, //魔女的飛掃把
3010044, //同一紅傘下
3010045, //寒冰椅子
3010046, //紅龍椅
3010047, //藍龍椅
3010048, //聖誕樹椅子
3010049, //雪房子
3010050, //公主凳
3010051, //沙漠兔子1靠墊
3010052, //沙漠兔子2靠墊
3010050, //3兔子紀念版椅子
3010054, //呼嚕呼嚕床
3010055, //冰雪糕丸子椅
3010057, //血色玫瑰
3010058, //世界末日
3010059, //甜甜的零食王座
3010060, //初心凳
3010061, //楓樹下
3010062, //竹凳
0301006, //3月亮星星抱枕椅
3010068, //露水椅子
3010069, //大黃風
3010070, //巨無霸品克繽
3010071, //神獸椅
3010075, //我為音樂狂
3010077, //貓頭鷹椅子
3010078, //大熊貓椅子
3010079, //肥貓貓椅子
3010080, //柿子樹鞦韆
3010085, //鬼娃娃椅子
3010086, //夢境沙發
3010093, //鮮美的火雞
3010094, //漂漂豬椅子
3010095, //石頭人座椅
3010096, //恐龍化石寶座
3010097, //堅固的木椅
3010098, //電視宅人
3010099, //北極熊椅子
3010100, //財神椅子
3010106, //雪狼戰椅
3010107, //龍龍的蛋殼椅
3010108, //幼龍秋千
3010110, //舒適大白熊椅子
3010111, //虎虎生威
3010112, //情書櫃子
3010115, //熊寶寶床
3010116, //搖滾之魂椅子
3010117, //魔法書椅子
3010118, //糖果音符椅子
3010119, //羊羊椅子
3010120, //彩蛋籃子
3010123, //夏日花朵
3010124, //都納斯噴氣椅子
3010125, //尼貝隆戰艦椅
3010126, //蝙蝠魔王座
3010127, //紮昆寶座
3010128, //黑龍王座
3010129, //酋長寶座
3010133, //帳篷椅
3010135, //節日獨角獸椅子
3010136, // 6周年怪物王座
3010137, //神龍椅子
3010138, //君主休憩椅
3010139, //私密空間
3010140, //早日康復床
3010141, //蛋糕椅子
3010142, //水族館椅子
3010144, //七夕椅子
3010149, //貓咪風扇椅
3010151, //無人島椅子
3010152, //黃三角帳篷椅
3010154, //機械椅子
3010155, //暗影雙刀的貓頭鷹椅子
3010156, //浮遊飛行器
3010157, //家族椅子
3010161, //鼠鼠椅
3010162, //果月椅子
3010163, //滿月椅
3010166, //雙刀同門
3010167, //豪華鮮奶蛋糕
3010168, //友誼萬歲椅子
3010169, //紙箱裡“求領養”
3010170, //雪夜椅子
3010171, //過來抱抱椅
3010172, //星空椅子
3010173, //萬聖節塔羅椅子
3010174, //女巫煉藥椅
3010175, //名畫家椅子
3010177, //手柄座椅
3010179, //燕尾服貓咪椅
3010180, //血量椅子
3010181, //MP椅子
3010182, //兔子家族椅
3010183, //胡蘿卜椅子
3010184, //冰釣椅子
3010185, //小夥伴品克繽
3010188, //班·雷昂椅子
3010189, //克裡塞椅子
3010193, //伊芙麗思的煉金瓶
3010194, //野營篝火椅子
3010195, //無價之寶椅子
3010196, //泡泡浴缸椅
3010197, //英雄的椅子-戰神
3010209, //香草冰淇淋月餅椅子
3010210, //草莓冰淇淋月餅椅子
3010211, //精靈王座
3010212, //藏獒椅子
3010217, //香橙果凍布丁
3010218, //喬克惡靈椅子
3010219, //綿羊酋長椅子
3010220, //我愛蛋糕椅子
3010221, //我愛餡餅椅子
3010222, //兔兔伴讀椅子
3010223, //狗狗好乖椅
3010224, //年糕冰淇淋椅子
3010225, //品克繽椅子
3010279, //鬼節南瓜椅子
3010280, //水果椅子
3010281, //猴子囚籠
3010282, //送子仙鶴椅
3010283, //飛毯椅
3010286, //諾特勒斯椅子
3010287, //精靈王座
3010288, //珍珠蚌椅子
3010289, //老人家讀童話椅子
3010290, //惡魔軍團椅
3010291, //
3010292, //暖爐椅（可交易）
3010293, //喬克惡靈椅子（可交易）
3010294, //黑色海豹靠墊（可交易）
3010295, //金色海豹靠墊（可交易）
3010296, //甜蜜的聖誕椅子
3010297, //水晶月亮
3010298, //白熊抱抱椅子
3010299, //小幼龍椅子
3010300, //橙色血量藥水椅子
3010303, //加肥抱抱椅
3010304, //惡魔綿羊椅子
3010305, //玫紅手柄座椅
3010306, //生如夏花椅子
3010308, //四葉草
3010311, //黑龍椅子
3010313, //粉色紮昆椅子
3010318, //噢我的女皇
3010354, //與克裡姆享受下午茶
3010355, //外星鉆機椅子
3010356, //溫馨荷花池
3010357, //美容椅子
3010360, //光之騎士椅子
3010361, //購物小推車椅子
3010362, //彩虹椅子
3010365, //休彼德蔓的古代石掌椅子
3010400, //水晶花園椅
3010401, //幻影卡牌椅
3010402, //生日派對椅
3010404, //希拉的梳妝椅
3010405, //擺鐘椅子
3010407, //印第安酋長寶座
3010408, //龍的傳人椅子
3010409, //粽子椅子
3010410, //艾麗莎的雙膝
3010411, //魚尾獅椅子
3010412, //雙子塔
3010414, //荊棘椅子
3010415, //熟睡鴨子椅
3010416, //巨無霸白雪人
3010417, //巨無霸企鵝王
3010421, //發財椅
3010423, //蘑菇朋友椅子
3010428, //水晶椅子
3010432, //仲夏可可島
3010434, //熱帶夏日椅子
3010435, //千年狐椅子
3010436, //邪惡黑龍椅子
3010437, //魔法之書
3010440, //尋找故鄉的月妙椅子
3010441, //邪惡之毒椅子
3018245, //企鵝王滑梯椅子
3018255, //白色魔法師的記憶
3018246, //冬夜裡的我與貓椅子
3018247, //某個聖誕節派對椅子
3018248, //北極狐椅子
3018227, //登上冰淇淋冰川椅子
3018228, //箱子裡的小貓咪椅子
3018229, //糖果雪人椅子
3018230, //黑魔法師椅子
3010446, //皮膚皇後椅子
3010447, //睡覺小鳥椅子
3010448, //泡泡浴椅子
3010449, //痊癒10周椅子
3010450, //艾莉珍椅子
3010453, //兔子乘風椅
3010454, //愛心雲朵椅
3010455, //紮昆的帝王椅子
3010456, //杜鵑花椅子
3010457, //拉尼婭野餐椅
3010458, //翻滾兔子椅子
3010459, //天使舞臺椅
3010460, //爆竹椅子
3010461, //賞月專用月桂樹秋千椅
3010462, //羅曼蒂克天文臺
3010465, //可愛音符椅子
3010490, //紅色大象總統椅子
3010491, //藍色毛驢總統椅子
3010492, //首腦椅子
3010493, //那就是我！
3010494, // TV椅子
3010499, //僵屍獵人座椅
3010505, //和奧爾卡一起看棒球
3010506, //萬聖節南瓜椅
3010510, //貓咪針線籃椅子
3010511, //貓咪公園椅子
3010512, //和半半在一起
3010513, //開心的皮埃爾
3010514, //可怕的女王
3010515, //奇石椅子
3010516, //嚕嚕啦啦印第安小孩
3010517, //印第安小孩的朋友
3010518, //印第安元老的兄弟
3010543, //魔力品克繽
3010544, //熱帶夏日椅子
3010545, //千年狐椅子
3010548, //可愛音符椅子
3010563, //月亮星星靠墊
3010584, //聖誕節幻影椅
3010585, //尖兵椅子
3010589, //需要充電！
3010591, //漫畫書椅子
3010592, //布萊克繽椅子
3010593, //新年快樂~
3010594, //藍莓蛋糕椅
3010598, //福袋椅子
3010599, //偵探打字機椅子
3010600, //福星月妙椅子
3010601, //貓咪竹籃椅
3010603, //雛祭娃娃1
3010604, //雛祭娃娃2
3010605, //雛祭娃娃3
3010609, //不是在做夢
3010612, //鏘鏘鏘椅子
3010620, //怪蜀黍的泄憤桌
3010621, //蛤蛤仙人椅
3010622, //我的好友丹珍之椅
3010623, //我的好友納奧之椅
3010624, //電視椅子
3010631, //金龍魚椅子
3010644, //被關在鐵窗裡的蒙奇
3010651, //楓之谷金剛（紅）
3010652, //楓之谷金剛（黑）
3010653, //楓之谷金剛（藍）
3010654, //楓之谷金剛（粉）
3010655, //楓之谷金剛（黃）
3010656, //楓之谷金剛（綠）
3010658, //夏日西瓜冰椅子
3010659, //巴士車站椅子
3010660, //夢幻公主城堡椅子
3010662, //章魚魚缸椅
3010664, //進化椅子
3010670, //絕對指環椅子
3010682, //天文臺椅子
3010688, //實驗室椅子
3010690, //滑浪飛船椅子
3010700, //大黃鴨椅子
3010703, //彩虹椅子
3010704, //懲戒之月妙椅子
3010705, //月妙和水靈椅子
3010708, //滿目韓文椅子
3010714, //堆王冠
3010715, //幸福9周年蛋糕氣球椅
3010716, //超級蘑菇椅子
3010717, //Marry me
3010718, //初戀雲朵朵沙發
3010719, //小幽靈卡斯珀
3010720, //勇士們，我愛你~
3010721, //漫畫書椅子
3010722, //僵屍獵人椅子
3010729, //孤獨男椅子
3010732, //翅膀自行車椅子
3010734, //貓箱椅子
3010735, //浪漫長椅
3010736, //萌萌育嬰搖籃
3010737, //動物英雄團椅子
3010738, //閃電三人組椅子
3010739, //雪人香波椅子
3010742, //漢謨拉比法庭椅子
3010743, //金字塔椅子
3010744, //楓之谷的磚頭朋友們
3010747, //和風紙鳶椅子
3010748, //日式拉面椅
3010750, //焦糖布丁椅子
3010751, //鯨魚椅子
3010752, //玫瑰鳥籠
3010753, //暖暖的被爐椅子
3010754, //百鬼夜行
3010755, //小丫丫坐便器椅子
3010756, //新年招財貓椅子
3010757, //你和我
3010758, //林之靈椅子
0301076, //0古代浴池椅子
3010761, //古代戰車椅子
3010766, //尖耳木椅
3010767, //雪人椅子
3010779, //金馬祥雲轎
3010780, //旋轉木馬
3010781, //馬上有你
3010783, //藍色邦尼屋
3010788, //巨無霸年夜飯
3010789, //爆竹聲聲
3010795, //森林中休息處椅子
3010797, //新春快樂椅子
3010799, //墳墓幽靈椅子
3010806, //桃櫻芳菲椅
3010810, //火車旅行椅
3010811, //嫩芽椅
3010813, //愛情水晶球的回憶
3010814, //粉絲抱枕椅子
3010815, //單身部隊海報椅
3010820, //迷你玩具別墅椅子
3010821, //童年玩具箱椅子
3010822, //貪吃鱷魚椅子
3010823, //蘑菇智能手錶椅子
3010824, //水星椅子
3010825, //金星椅子
3010826, //地球椅子
3010827, //火星椅子
3010828, //木星椅子
3010829, //土星椅子
3010830, //天王星椅子
3010831, //海王星椅子
//3015564, //太陽椅
3010836, //度假地奧拉夫椅子
3010837, //溫泉奧拉夫椅子
3010838, //冰城堡椅子
3010842, //貓貓郊遊房車
3010843, //兔兔郊遊房車
3010844, //麻辣教室椅子
3010845, //小金豬椅子
3010848, //紅地毯主人公椅子
3010849, //最佳新人椅子
3010850, //潮流評論家椅子
3010851, //夏日沁飲椅子
3010853, //心花怒放椅子
3010854, //神秘怪物共聚一堂！
3010863, //憤怒的美發師椅子
3010864, //紫色妖姬王座
3010865, //紮昆點贊椅
3010876, //楓之谷行星椅子
3010877, //人魚珊瑚礁
3010878, //足球助威椅
3010879, //繁星椅子
3010894, //一杯咖啡的悠閑
3010895, //阿卡伊勒童話書椅子
3010896, //我的女皇椅子
3010898, //迷你神獸椅子
3010935, //狗狗酣睡椅子
3010936, //青蛙跳樓機
3010947, //與飛龍在天派一起
3010948, //與虎嘯九天派一起
3010967, //假面紳士海報椅子
3010968, //假面紳士抱枕椅子
3010980, //兔子箱椅子
3010983, //家庭聚餐椅子
3010984, //皇宮盛宴椅子
3010999, //“主人，請用餐”椅子
3011000, //釣魚用椅子
3012002, //浴桶
3013000, //櫻花樹下
3013002, //煙花祭
3013007, //蛇年團圓椅
3013008, //第104期訓練兵團[小組椅子]
3013009, //阿裡山火車
3014000, //驚人漫畫椅子
3014001, //完美漫畫椅子
3014002, //擊掌漫畫椅子
3014003, //封面模特椅子
3014004, //案件聚焦椅子
3014006, //南國度假信息椅子
3014009, //黑板椅子
3014010, //捕獲僵屍拍立得
3014011, //MVP鉆石椅子
3014012, //富士山下椅子
3014013, //與前來射手村兜風的怪物們合影！
3014014, //射手村演出照
3014015, //廢棄
3014016, //阿裡
3014017,  //時間神殿
3014018, //林中之城
3014019, //V霓虹版椅子
3014020, //決戰巔峰者
3014021, //和你一同的春季踏青
3014022, //和你一同密室逃脫之日
3014023, //你還有那些怪物
3014024, //在月色鵲橋相遇的那一天
3014027, //小黑板椅子
3015000, //玻璃瓶裡的怪物
3015001, //淘氣喵喵椅
3015002, //七彩摩天輪椅子
3015006, //聖誕禮物椅
3015007, //花蘑菇的聖誕節
3015008, //獻出心臟的敬禮
3015009, //小蘋果椅子
3015011, //與兒時夥伴同在
3015013, //立體機動訓練中！
3015028, //燈泡裡的人魚
3015029, //宇宙沖撞椅
3015030, //與南哈特的回憶椅
3015031, //閃耀楓之谷椅
3015032, //寒冰萌動火車椅
3015033, //福袋萌動火車椅
3015034, //和羊咩咩一起椅子
3015036, //聖誕節椅子
3015046, //傳說中的獅獸椅子
3015047, //壓歲錢萬歲！
3015048, //碧歐蕾塔莎啦啦火車椅
3015049, //黑色天堂火車椅
3015050, //火車頭椅
3015051, //巨無霸國際巨星
3015053, //松軟三重綿羊椅
3015054, //愛之騎士椅
3015055, //血腥瑪麗椅
3015056, //死亡騎士椅
3015057, //煙花綻放椅子
3015058, //五彩繽紛花車巡遊椅
3015059, //浪漫甜心巧克力椅子
3015060, //五彩糖罐椅子
3015061, //單身情侶椅
3015062, //NENE炸雞翅椅
3015064, //冰雪箱椅子
3015075, //鏟雪狂人椅子
3015076, //雛祭娃娃4
3015077, //雛祭娃娃5
3015078, //雛祭娃娃6
3015080, //被蛋卷椅子
3015083, //萌動年糕湯火車椅
3015089, //訓練師庭院椅
3015090, //單身之王椅
3015091, //巧克力湯椅子
3015092, //卡卡隆與巧克力工廠椅
3015096, //羊羊幻想牧場椅子
3015098, //花蘑菇偽裝椅子
3015099, //紮納羅非偽裝椅子
3015100, //奧爾卡的布偶兔椅子
3015109, //花花幻想曲
3015114, //情侶部隊海報椅（女）
3015118, //希拉和麥格納斯
3015119, //突擊！伊莉娜樂隊椅子
3015129, //白色天堂椅子
3015130, //土豪嬰兒推車
3015131, //巨大鼻涕泡椅子
3015132, //大粽子沙發椅
3015142, //武士精神椅子
3015143, //巨大彩色金魚標本椅子
3015155, //火焰之斯烏椅子
3015177, //壽司公仔椅子
3015178, //螢火之森椅子
3015181, //仲夏夜之夢椅子
3015182, //蝶戀花椅子
3015183, //綠水靈背景椅子
3015193, //被馴服的鯨魚椅子
3015195, //鬼狐椅子
3015197, //閃耀楓之谷椅
3015210, //喜歡奶酪！
3015211, //櫻花陶醉椅子
3015224, //夢幻水晶球椅子
3015225, //和大象一起自拍椅子
3015227, //與莫拉野餐椅子
3015228, //暴力熊人偶裝椅子
3015229, //刀疤獅王人偶裝椅子
3015234, //少年沙灘聚會
3015236, //粉色蛙漂流椅子
3015240, //武陵道場縮微椅子
3015241, //與稻草人相伴椅子
3015243, //嬰兒車椅子
3015244, //超能力者椅子
3015245, //刀劍椅子
3015246, //土豪金幣椅子
3015247, //戰鬥吧！傳說之回歸椅子
3015248, //孤獨旅行者椅子
3015257, //月下庭院椅子
3015258, //兔兒爺爺虎虎椅子
3015259, //兔兒爺爺的腿座
3015260, //兔兒奶奶的腿座
3015262, //滿月清輝椅子
3015263, //黃色蛙漂流椅子
3015264, //今天我是主婦椅子
3015272, //紫色蛙漂流椅子
3015273, //羊羊疊疊樂
3015274, //國慶節噴泉椅子
3015276, //拳王烏魯斯椅子
3015277, //烏魯斯打獵椅子
3015278, //烏魯斯貪吃椅子
3015279, //霸王的王座
3015286, //瘋人院拘束衣
3015287, //瘋人院手術臺
3015288, //瘋人院治療椅
3015295, //紳士青鳥花園
3015297, //人生逆轉！興夫椅子
3015298, //楓之谷金剛（紅）
3015300, //人魚的珊瑚礁
3015302, //安德洛墨達椅子
3015303, //幸福繡花鞋椅子
3015304, //嘩啦啦大水車
3015309, // I want you椅子
3015310, //塞維利亞西班牙廣場椅子
3015316, //突擊！伊莉娜樂隊椅子
3015317, //國慶節噴泉椅子
3015325, //夜晚滿月椅子
3015326, //叮當疊羅漢椅子
3015328, //楓之谷電動纜車椅子
3015329, //妖怪壇椅子
3015330, //我不怕！（哼）
3015331, //貓咪紙屋
3015332, //魅惑九尾狐
3015333, //降靈術毛莫
3015338, //秘密花園椅子
3015341, //黑貓房車
3015342, //冬眠椅子
3015343, //冰雪企鵝王椅子
3015344, //僵屍獵人椅子
3015346, //與精英南瓜僵屍相伴
3015349, //青蛙搖搖機椅子
3015350, //黑色天堂玩具椅
3015354, //楓之谷微博椅子
3015367, //斯烏鐵粉椅子
3015374, //射手村豬豬占卜椅子
3015375, //埃德爾斯坦熔鉛占卜椅子
3015376, //東方明珠占卦椅子
3015377, //裡恩冰川占卜椅子
3015380, //蕉蕉仙人椅
3015382, //飛翔吧！悟空椅子
3015383, //泡溫泉椅子
3015384, //金咕隆咚伸縮棒椅子
3015385, //日式傳統茶椅子
3015386, //英式紅茶椅子
3015394, //雪龜島釣魚椅子
3015395, //鮮嫩的海鮮椅子
3015401, //來咬我呀~
3015408, //玩具國的主人公
3015415, //猴子椅子
3015416, //溫暖的溫泉入場券
3015419, //外灘爆竹椅子
3015424, //超級餃子椅子
3015425, //和猴子一起擊鼓椅子
3015426, //和猴子一起面具舞椅子
3015427, //和猴子一起玩麻將椅子
3015428, //和猴子一起放煙花椅子
3015429, //享受冬季的秋千椅子
3015430, //年獸椅子
3015431, //楓之谷電動車椅子
3015436, //竹野子椅子
3015437, //被吞沒的世界椅子
3015438, //阿布拉克薩斯椅子
3015439, //木偶戲椅子
3015440, //錢多多椅子
3015443, //打倒小羊駝椅子
3015447, //怪物捕捉椅子
3015448, //解除怨恨椅子
3015449, //守護戰士
3015450, //黑暗追隨者
3015451, //呆萌兔兔靠墊椅
3015461, //孤獨旅行者椅子
3015468, //超越石椅子
3015473, //搖擺種子椅子
3015474, //花田窗戶
3015481, //輕功箱椅子
3015482, //沈睡的鴨子椅子
3015516, //草莓星的主人
3015518, // 13周年周五椅子
3015519, //蕉蕉仙人椅
3015525, //偵探團放大鏡椅子
3015526, //藍天奇妙幻想椅子
3015529,  //我和小雞雞椅子
3015538, //露陷的粽子
3015541, //品克繽冰淇淋雨傘
3015542, //和超能力者在一起椅子
3015543, //超能力者魔方椅子
3015545, //玫瑰天使水晶瓶
3015547, //銀色滿月椅子
3015551, //布袋怪物扭蛋椅子
3015552, //懸掛的景觀燈泡椅子
3015573, // DJ吉姆的打碟臺
3015574, //阿布拉克薩斯椅子
3015579, //水流噴射推進器座椅
3015580, //涼爽沙灘排球椅
3015581, //水槍體驗椅子
3015582, //騎士團椅子
3015583, //反抗者椅子
3015585, //極光白雪人椅子
3015586, //白貝殼遊泳圈椅子
3015587, //皇後冰淇淋椅子
3015597, //蘑菇神社賞月椅子
3015598, //蘑菇神社蟬yu椅子
3015599, //消防車椅子
3015600, //努力的生意人椅子
3015604, //音樂盛典DJ皮亞
3015605, //音樂盛典DJ
3015606, //音樂盛典DJ
3015607, //音樂盛典DJ
3015608, //音樂盛典DJ
3015609, //音樂盛典DJ
3015610, //妖精學院艾利涅椅子
3015611, //地上樂園金海灘椅子
3015612, //列娜海峽椅子
3015613, //閉月羞花的碧歐蕾塔椅子
3015614, //次元圖書館椅子
3015619, //草莓城主椅子
3015620, //黑色天堂玩具椅子
3015621, //蘑菇神社賞花椅子
3015623, //銀光滿月椅子
3015627, //不死金剛棺材椅子
3015628, //幽靈朋友椅子
3015629, //我也是主角
3015630, //記憶中的少女
3015631, //尷尬的晚餐
3015632, //和雪孩子一起
3015633, //夢之都市椅子
3015636, //燃情V椅
3015637, //路西德的花
3015638, //噴泉戲水椅子
3015643, //啾啾島椅子
3015644, //復古餐車椅子
3015645, //古典餐車椅子
3015646, //奢華餐車椅子
3015652, //歡樂的回鄉路椅子
3015653, //賞月椅子
3015655, //小幽靈可可椅子
3015656, //一個晴朗的日子
3015657, //繽紛水果碗椅子
3015658, //中秋煎餅椅子
3015659, //倉鼠轉輪椅子
3015661, //躲貓貓抽屜椅
3015662, //烏鴉喝水椅子
3015663, //訓民正音椅子
3015664, //廢都塔的回憶
3015665, //大海盜椅子
3015666, //什麼時候長大椅子
3015667, //秋季之湖椅子
3015670, //饑餓的limos椅子
3015671, //小型勇士之地椅子
3015674, //小型童心之地椅子
3015675, //聖誕爺爺椅子
3015687, //不給糖就搗蛋椅子
3015688, //萬聖節糖果大贏家椅子
3015689, //特大萬聖節糖果椅子
3015690, //與萬聖貓同在椅子
3015691, //白雪人助手椅子
3015692, //企鵝偵探椅子
3015693, //蛋黃地震椅子
3015694, //冰塊中的品克繽椅子
3015695, //冰塊中的花蘑菇椅子
3015696, //冰塊中的綠水靈椅子
3015697, //冰塊中骷髏魚椅子
3015698, //冰塊中的仙人掌椅子
3015699, //冰塊中的漂漂豬
3015700, //破蛋而出！新年快樂！
3015701, //讓我們成為雪人吧
3015702, //聖誕明信片椅子
3015703, //馬卡龍甜蜜抱枕椅
3015704, //古典手工椅子
3015705, //古代守護兵椅子
3015706, //露宿小雞椅子
3015707, //小雞馬戲團椅子
3015708, //白煙寥寥的蒸包椅子
3015710, //喵喵塔
3015711, //可愛的倉鼠小屋椅子
3015712, //路西德的噩夢床
3015713, //巧克力注入機椅子
3015714, //好吃的巧克力面膜
3015715, //和鵺一起巧克力派對
3015716, //和兼信一起巧克力派對
3015717, //情人節驚嚇箱椅子
3015721, //貓咪們的最愛
3015725, // 13周年回憶之樹
3015739, //人氣爆棚的儲物櫃
3015745, //楓之谷M明星
3015747, //目標!在床上玩
3015748, // 12月拿鐵椅子
3015749, //楓之谷5000天蛋糕椅
3015750, //黑玫瑰秋千椅
3015753, //大雪紛飛雪球椅
3015754, //曉月光斬椅
3015755, //召喚雪女椅
3015756, //猛龍暴風椅
3015757, //黑洞椅
3015758, //靈獸盛宴椅
3015759, //超星魔導椅子
3015760, //新年森林晚會椅子
3015761, //楓之谷人氣之王
3015762, // BEYOND椅子
3015763, //和黃金雞蛋的回憶之椅
3015787, //兔兔彩燈椅子
3015788, //雪熊滑滑梯椅子
3015789, //柿子樹椅子
3015790, //喜鵲跳跳板椅子（女）
3015795, //貪心的貓咪旅行車椅子
3015796, //羊羊彈簧椅
3015797, //我不是瓜子椅子
3015800, // BBQ椅子
3015801, // BEYOND之翼椅子
3015802, //阿爾卡那精靈的木椅
3015803, //灌籃高手椅子
3015810, //狗狗野餐椅
3015811, //動物救援隊椅子
3015812, //花田裡犯了錯
3015813, //玻璃之城椅子
3015814, //兔子巧克力椅子
3015817, //舞動的花環椅子
3015818, //中招了椅子
//3015819, //冒險王魅力椅
3015820, //暗影樹的花
3015821, //大櫻桃椅子
3015822, //呱呱青蛙椅
3015823, //旋轉木馬椅
3015837, //廣告裡的人是我!
3015838, //只能看
3015840, //粽香小童星葉船椅子
3015841, //蝶兒飛椅子
3015842, //宇宙光線槍椅子
3015844, //絢爛雲彩椅
3015845, //發射星星椅子
3015846, //石頭精靈椅子
3015847, //探索火箭椅
3015848, //被捕食者吞掉了！
3015849, //埃爾露娜散步中
3015850, //炸裂吧！間歇泉
3015857, //冰凍星球椅
3015858, //藍海星球椅
3015859, // M-426椅
3015860, //比特椅
3015861, //米涅爾椅
3015862, //拔蘿卜椅子
3015863, //沙灘嬉戲椅子
3015864, //綠水靈樂隊椅子
3015865, //小小楓之谷星球椅
3015866, //埃爾露娜行星椅子
3015867, //靈魂的重量椅子
3015869, //大象蹺蹺板椅子
3015880, //海岸秋千椅
3015886, //在樹上搖搖欲墜
3015887, //核心寶石椅
3015888, //炎炎夏日椅子
3015890, //幸福之門
3015892, //黑玫瑰秋千椅
3015894, //海洋安全要員椅子
3015895, //粒粒都是精華椅子
3015899, //擲骰大師椅
3015900, //熊熊樂園噴泉
3015901, //兔子星球椅子
3015902, //泰國發佈紀念椅
3015903, //黑暗萬聖節椅子
3015911, //炸裂吧！間歇泉
3015913, //絕對味覺椅子
3015934, //和反抗者教官在海邊椅子
3015962, //混沌莫拉斯之椅
3015965, //胡子先森椅
3015966, //狗狗野餐椅
3015968, //小貓亂撞椅子
3015970, //水晶馴鹿椅
3015971, //雪兔椅子
3015975, //激動特選影片椅
3015976, //主人公椅子
3015990, //小小楓之谷星球椅
3015996, //極限滑板椅子
3015999, //流浪玩偶劇場
3016101, //怪物水晶球秋千椅
3016000, //大象蹺蹺板椅子
3015604, //音樂盛典DJ皮亞椅子
3015605, //音樂盛典沙子圖團椅子
3015606, //音樂盛典後街吉姆椅子
3015607, //音樂盛典DJ品克繽椅子
3015608, //音樂盛典林中兄弟椅子
3015609, //音樂盛典全明星椅子
3018002, //非你莫屬椅子
3018308, //黃金豬椅子
3018307,
1112976,
1112974,
1112973,
1112971,
1112970

);

let boxId = 5220000;//箱子ID


let ss = "#b消耗#v"+boxId+"#,可抽取傷害字型或座椅"
ss += "\r\n是否使用？";
let YN = npc.askYesNo(ss);
if(YN == 1){
		if(player.hasItem(boxId,1)){
			
			let ran = Math.floor(Math.random() * items.length);
			if(player.canGainItem(items[ran],1)){
				player.gainItem(items[ran],1);
				player.loseItem(boxId,1);
//				npc.broadcastNoticeWithoutPrefix("【超值禮包】 玩家  "+player.getName()+" 獲得了#z3015609#個");				
//				npc.broadcastPlayerNotice(1,"百寶箱: 恭喜 " + player.getName() + " 抽取了"+items[ran]+".");

//				var item1 = player.gainGachaponItem("制作中心", items[ran], 1, 1);
				npc.broadcastNoticeWithoutPrefix("『百寶卷』：恭喜玩家 " + player.getName() + " 在百寶抽獎機抽到了【" + player.makeItemWithId(items[ran]).getItemName() + "】1個。");
				npc.say("恭喜您抽到#r#z" + items[ran] + "##k#v"+items[ran]+"#一個.");
//				player.makeItemWithId(items[ran]).getItemName();				
//				npc.say("抽取成功");
			}else{
				npc.say("請清理背包");
			}
		}else{
			
			npc.say("你沒有#v"+boxId+"#");
		}
}else{
	npc.say("不想使用嗎？下次再見。");
}