/*
 * AuroMS MapleStory server emulator written in Java
 * Copyright (C) 2018 dgms
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/* global npc, player, map */

var jobData = new Array(
    Array("凱殷(1轉)", 6300, 6003, 10),
    Array("凱殷(2轉)", 6310, 6300, 30),
    Array("凱殷(3轉)", 6311, 6310, 60),
    Array("凱殷(4轉)", 6312, 6311, 100),
    Array("凱殷(5轉)", 6312, 6312, 200),

    Array("墨玄(1轉)", 17500, 17000, 10),
    Array("墨玄(2轉)", 17510, 17500, 30),
    Array("墨玄(3轉)", 17511, 17510, 60),
    Array("墨玄(4轉)", 17512, 17511, 100),
    Array("墨玄(5轉)", 17512, 17512, 200),

    Array("阿戴爾(1轉)", 15100, 15002, 10),
    Array("阿戴爾(2轉)", 15110, 15100, 30),
    Array("阿戴爾(3轉)", 15111, 15110, 60),
    Array("阿戴爾(4轉)", 15112, 15111, 100),
    Array("阿戴爾(5轉)", 15112, 15112, 200),

    Array("開拓者(1轉)", 301, 0, 10, 3),
    Array("開拓者(2轉)", 330, 301, 30, 3),
    Array("開拓者(3轉)", 331, 330, 60, 3),
    Array("開拓者(4轉)", 332, 331, 100, 3),
    Array("開拓者(5轉)", 332, 332, 200, 3),

    Array("亞克(1轉)", 15500, 15001, 10),
    Array("亞克(2轉)", 15510, 15500, 30),
    Array("亞克(3轉)", 15511, 15510, 60),
    Array("亞克(4轉)", 15512, 15511, 100),
    Array("亞克(5轉)", 15512, 15512, 200),

    Array("伊利恩(1轉)", 15200, 15000, 10),
    Array("伊利恩(2轉)", 15210, 15200, 30),
    Array("伊利恩(3轉)", 15211, 15210, 60),
    Array("伊利恩(4轉)", 15212, 15211, 100),
    Array("伊利恩(5轉)", 15212, 15212, 200),

    Array("虎影(1轉)", 16400, 16000, 10),
    Array("虎影(2轉)", 16410, 16400, 30),
    Array("虎影(3轉)", 16411, 16410, 60),
    Array("虎影(4轉)", 16412, 16411, 100),
    Array("虎影(5轉)", 16412, 16412, 200),

    Array("卡蒂娜(1轉)", 6400, 6002, 10),
    Array("卡蒂娜(2轉)", 6410, 6400, 30),
    Array("卡蒂娜(3轉)", 6411, 6410, 60),
    Array("卡蒂娜(4轉)", 6412, 6411, 100),
    Array("卡蒂娜(5轉)", 6412, 6412, 200),

    Array("盜賊", 400, 0, 10, 1),
    Array("下忍", 430, 400, 20, 1),
    Array("中忍", 431, 430, 30, 1),
    Array("上忍", 432, 431, 45, 1),
    Array("隱忍", 433, 432, 60, 1),
    Array("影武者", 434, 433, 100, 1),
    Array("影武者(5轉)", 434, 434, 200, 1),

    Array("砲手(1轉)", 501, 0, 10, 2),
    Array("重砲兵(2轉)", 530, 501, 30, 2),
    Array("重砲兵隊長(3轉)", 531, 530, 60, 2),
    Array("重砲指揮官(4轉)", 532, 531, 100, 2),
    Array("重砲指揮官(5轉)", 532, 532, 200, 2),

    Array("蒼龍俠客(1轉)", 508, 0, 10, 10),
    Array("蒼龍俠客(2轉)", 570, 508, 30, 10),
    Array("蒼龍俠客(3轉)", 571, 570, 60, 10),
    Array("蒼龍俠客(4轉)", 572, 571, 100, 10),
    Array("蒼龍俠客(5轉)", 572, 572, 200, 10),

    Array("戰士(1轉)", 100, 0, 10),
    Array("狂戰士(2轉)", 110, 100, 30),
    Array("十字軍(3轉)", 111, 110, 60),
    Array("英雄(4轉)", 112, 111, 100),
    Array("英雄(5轉)", 112, 112, 200),

    //雪吉拉or品克繽
    //Array("雪吉拉", 13500, 0, 10),
    //Array("皮卡啾", 13100, 0, 10),
    //Array("品克繽", 13100, 13000, 10),//如果轉職可以直接創建品克繽的話就開這裡,//上面的 否則就用新手

    Array("見習騎士(2轉)", 120, 100, 30),
    Array("騎士(3轉)", 121, 120, 60),
    Array("聖騎士(4轉)", 122, 121, 100),
    Array("聖騎士(5轉)", 122, 122, 200),

    Array("槍騎兵(2轉)", 130, 100, 30),
    Array("嗜血狂騎(3轉)", 131, 130, 60),
    Array("黑騎士(4轉)", 132, 131, 100),
    Array("黑騎士(5轉)", 132, 132, 200),

    Array("法師(1轉)", 200, 0, 10),
    Array("巫師(火、毒)(2轉)", 210, 200, 30),
    Array("魔導士(火、毒)(3轉)", 211, 210, 60),
    Array("大魔導士(火、毒)(4轉)", 212, 211, 100),
    Array("大魔導士(火、毒)(5轉)", 212, 212, 200),

    Array("巫師(冰、雷)(2轉)", 220, 200, 30),
    Array("魔導士(冰、雷)(3轉)", 221, 220, 60),
    Array("大魔導士(冰、雷)(4轉)", 222, 221, 100),
    Array("大魔導士(冰、雷)(5轉)", 222, 222, 200),

    Array("僧侶(2轉)", 230, 200, 30),
    Array("祭司(3轉)", 231, 230, 60),
    Array("主教(4轉)", 232, 231, 100),
    Array("主教(5轉)", 232, 232, 200),

    Array("弓箭手(1轉)", 300, 0, 10),
    Array("獵人(2轉)", 310, 300, 30),
    Array("遊俠(3轉)", 311, 310, 60),
    Array("箭神(4轉)", 312, 311, 100),
    Array("箭神(5轉)", 312, 312, 200),

    Array("弩弓手(2轉)", 320, 300, 30),
    Array("狙擊手(3轉)", 321, 320, 60),
    Array("神射手(4轉)", 322, 321, 100),
    Array("神射手(5轉)", 322, 322, 200),

    Array("盜賊(1轉)", 400, 0, 10),
    Array("刺客(2轉)", 410, 400, 30),
    Array("暗殺者(3轉)", 411, 410, 60),
    Array("夜使者(4轉)", 412, 411, 100),
    Array("夜使者(5轉)", 412, 412, 200),

    Array("俠盜(2轉)", 420, 400, 30),
    Array("神偷(3轉)", 421, 420, 60),
    Array("暗影神偷(4轉)", 422, 421, 100),
    Array("暗影神偷(5轉)", 422, 422, 200),

    Array("海盜(1轉)", 500, 0, 10),
    Array("打手(2轉)", 510, 500, 30),
    Array("格鬥家(3轉)", 511, 510, 60),
    Array("拳霸(4轉)", 512, 511, 100),
    Array("拳霸(5轉)", 512, 512, 200),

    Array("槍手(2轉)", 520, 500, 30),
    Array("神槍手(3轉)", 521, 520, 60),
    Array("槍神(4轉)", 522, 521, 100),
    Array("槍神(5轉)", 522, 522, 200),

    /*騎士團聯盟-------------------*/
    Array("聖魂劍士(1轉)", 1100, 1000, 10),
    Array("聖魂劍士(2轉)", 1110, 1100, 30),
    Array("聖魂劍士(3轉)", 1111, 1110, 60),
    Array("聖魂劍士(4轉)", 1112, 1111, 100),
    Array("聖魂劍士(5轉)", 1112, 1112, 200),

    Array("烈焰巫師(1轉)", 1200, 1000, 10),
    Array("烈焰巫師(2轉)", 1210, 1200, 30),
    Array("烈焰巫師(3轉)", 1211, 1210, 60),
    Array("烈焰巫師(4轉)", 1212, 1211, 100),
    Array("烈焰巫師(5轉)", 1212, 1212, 200),

    Array("破風使者(1轉)", 1300, 1000, 10),
    Array("破風使者(2轉)", 1310, 1300, 30),
    Array("破風使者(3轉)", 1311, 1310, 60),
    Array("破風使者(4轉)", 1312, 1311, 100),
    Array("破風使者(5轉)", 1312, 1312, 200),

    Array("暗夜行者(1轉)", 1400, 1000, 10),
    Array("暗夜行者(2轉)", 1410, 1400, 30),
    Array("暗夜行者(3轉)", 1411, 1410, 60),
    Array("暗夜行者(4轉)", 1412, 1411, 100),
    Array("暗夜行者(5轉)", 1412, 1412, 200),

    Array("閃雷悍將(1轉)", 1500, 1000, 10),
    Array("閃雷悍將(2轉)", 1510, 1500, 30),
    Array("閃雷悍將(3轉)", 1511, 1510, 60),
    Array("閃雷悍將(4轉)", 1512, 1511, 100),
    Array("閃雷悍將(5轉)", 1512, 1512, 200),

    /*騎士團聯盟-------------------*/

    Array("狂狼勇士(1轉)", 2100, 2000, 10),
    Array("狂狼勇士(2轉)", 2110, 2100, 30),
    Array("狂狼勇士(3轉)", 2111, 2110, 60),
    Array("狂狼勇士(4轉)", 2112, 2111, 100),
    Array("狂狼勇士(5轉)", 2112, 2112, 200),

    Array("龍魔導士(1轉)", 2200, 2001, 10),
    Array("龍魔導士(2轉)", 2211, 2200, 30),
    Array("龍魔導士(3轉)", 2214, 2211, 60),
    Array("龍魔導士(4轉)", 2217, 2214, 100),
    Array("龍魔導士(5轉)", 2217, 2217, 200),

    Array("精靈遊俠(1轉)", 2300, 2002, 10),
    Array("精靈遊俠(2轉)", 2310, 2300, 30),
    Array("精靈遊俠(3轉)", 2311, 2310, 60),
    Array("精靈遊俠(4轉)", 2312, 2311, 100),
    Array("精靈遊俠(5轉)", 2312, 2312, 200),

    Array("幻影俠盜(1轉)", 2400, 2003, 10),
    Array("幻影俠盜(2轉)", 2410, 2400, 30),
    Array("幻影俠盜(3轉)", 2411, 2410, 60),
    Array("幻影俠盜(4轉)", 2412, 2411, 100),
    Array("幻影俠盜(5轉)", 2412, 2412, 200),

    Array("夜光(1轉)", 2700, 2004, 10),
    Array("夜光(2轉)", 2710, 2700, 30),
    Array("夜光(3轉)", 2711, 2710, 60),
    Array("夜光(4轉)", 2712, 2711, 100),
    Array("夜光(5轉)", 2712, 2712, 200),

    /*惡魔聯盟--------------------------*/
    Array("惡魔殺手(1轉)", 3100, 3001, 10),
    Array("惡魔殺手(2轉)", 3110, 3100, 30),
    Array("惡魔殺手(3轉)", 3111, 3110, 60),
    Array("惡魔殺手(4轉)", 3112, 3111, 100),
    Array("惡魔殺手(5轉)", 3112, 3112, 200),

    Array("惡魔復仇者(1轉)", 3101, 3001, 10),
    Array("惡魔復仇者(2轉)", 3120, 3101, 30),
    Array("惡魔復仇者(3轉)", 3121, 3120, 60),
    Array("惡魔復仇者(4轉)", 3122, 3121, 100),
    Array("惡魔復仇者(5轉)", 3122, 3122, 200),

    /*惡魔聯盟--------------------------*/

    /*反抗者聯盟--------------------------*/
    Array("狂豹獵人(1轉)", 3300, 3000, 10),
    Array("狂豹獵人(2轉)", 3310, 3300, 30),
    Array("狂豹獵人(3轉)", 3311, 3310, 60),
    Array("狂豹獵人(4轉)", 3312, 3311, 100),
    Array("狂豹獵人(5轉)", 3312, 3312, 200),

    Array("煉獄巫師(1轉)", 3200, 3000, 10),
    Array("煉獄巫師(2轉)", 3210, 3200, 30),
    Array("煉獄巫師(3轉)", 3211, 3210, 60),
    Array("煉獄巫師(4轉)", 3212, 3211, 100),
    Array("煉獄巫師(5轉)", 3212, 3212, 200),

    Array("機甲戰神(1轉)", 3500, 3000, 10),
    Array("機甲戰神(2轉)", 3510, 3500, 30),
    Array("機甲戰神(3轉)", 3511, 3510, 60),
    Array("機甲戰神(4轉)", 3512, 3511, 100),
    Array("機甲戰神(5轉)", 3512, 3512, 200),

    Array("爆拳槍神(1轉)", 3700, 3000, 10),
    Array("爆拳槍神(2轉)", 3710, 3700, 30),
    Array("爆拳槍神(3轉)", 3711, 3710, 60),
    Array("爆拳槍神(4轉)", 3712, 3711, 100),
    Array("爆拳槍神(5轉)", 3712, 3712, 200),

    /*反抗者聯盟--------------------------*/

    /*尖兵聯盟--------------------------*/
    Array("傑諾(1轉)", 3600, 3002, 10),
    Array("傑諾(2轉)", 3610, 3600, 30),
    Array("傑諾(3轉)", 3611, 3610, 60),
    Array("傑諾(4轉)", 3612, 3611, 100),
    Array("傑諾(5轉)", 3612, 3612, 200),

    /*尖兵聯盟--------------------------*/

    /*米哈爾聯盟--------------------------*/
    Array("米哈逸(1轉)", 5100, 5000, 10),
    Array("米哈逸(2轉)", 5110, 5100, 30),
    Array("米哈逸(3轉)", 5111, 5110, 60),
    Array("米哈逸(4轉)", 5112, 5111, 100),
    Array("米哈逸(5轉)", 5112, 5112, 200),

    /*米哈爾聯盟--------------------------*/

    Array("凱撒(1轉)", 6100, 6000, 10),
    Array("凱撒(2轉)", 6110, 6100, 30),
    Array("凱撒(3轉)", 6111, 6110, 60),
    Array("凱撒(4轉)", 6112, 6111, 100),
    Array("凱撒(5轉)", 6112, 6112, 200),

    Array("天使破壞者(1轉)", 6500, 6001, 10),
    Array("天使破壞者(2轉)", 6510, 6500, 30),
    Array("天使破壞者(3轉)", 6511, 6510, 60),
    Array("天使破壞者(4轉)", 6512, 6511, 100),
    Array("天使破壞者(5轉)", 6512, 6512, 200),
    /*卡莉--------------------------*/
    Array("卡莉(1轉)", 15403, 15405, 10),
    Array("卡莉(2轉)", 15400, 15403, 30),
    Array("卡莉(3轉)", 15410, 15400, 60),
    Array("卡莉(4轉)", 15412, 15410, 100),
    Array("卡莉(5轉)", 15412, 15412, 200),
	
    Array("隱月(1轉)", 2500, 2005, 10),
    Array("隱月(2轉)", 2510, 2500, 30),
    Array("隱月(3轉)", 2511, 2510, 60),
    Array("隱月(4轉)", 2512, 2511, 100),
    Array("隱月(5轉)", 2512, 2512, 200),

    Array("劍豪(1轉)", 4100, 4001, 10),
    Array("劍豪(2轉)", 4110, 4100, 30),
    Array("劍豪(3轉)", 4111, 4110, 60),
    Array("劍豪(4轉)", 4112, 4111, 100),
    Array("劍豪(5轉)", 4112, 4112, 200),

    Array("陰陽師(1轉)", 4200, 4002, 10),
    Array("陰陽師(2轉)", 4210, 4200, 30),
    Array("陰陽師(3轉)", 4211, 4210, 60),
    Array("陰陽師(4轉)", 4212, 4211, 100),
    Array("陰陽師(5轉)", 4212, 4212, 200),

    Array("凱內西斯(1轉)", 14200, 14000, 10),
    Array("凱內西斯(2轉)", 14210, 14200, 30),
    Array("凱內西斯(3轉)", 14211, 14210, 60),
    Array("凱內西斯(4轉)", 14212, 14211, 100),
    Array("凱內西斯(5轉)", 14212, 14212, 200),

    Array("拉拉(1轉)", 16200, 16001, 10),
    Array("拉拉(2轉)", 16210, 16200, 30),
    Array("拉拉(3轉)", 16211, 16210, 60),
    Array("拉拉(4轉)", 16212, 16211, 100),
    Array("拉拉(4轉)", 16212, 16212, 200),

    Array("幻獸師", 11212, 11212, 200, 0),
);
//player.setJob(0);
var a30 = "#fEffect/CharacterEff/1022223/6/0#" //跑马灯
var a31 = "#fEffect/CharacterEff/1022223/7/0#" //跑马灯
var a32 = "#fEffect/CharacterEff/1022223/8/0#" //跑马灯
var a38 = "#fItem/Pet/5000213.img/stand0/0#";//藍色惡魔
var flag = false;
var text = "Welcome to the special trip              " + a38 + "\r\n";

text += "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "" + a30 + "" + a30 + "" + a31 + "" + a31 + "" + a32 + "" + a32 + "\r\n";

text += "#b請選擇您要轉職的職業：\r\n\r\n";
text += "#r轉職後自動為你滿技能,五轉除外\r\n";
text += "#r轉職後自動為你滿技能,五轉除外\r\n";
text += "#r轉職後自動為你滿技能,五轉除外#b\r\n";
var subjob = player.getSubJob();
for (var i = 0; i < jobData.length; i++) {
    if (subjob == 1) {
        if (player.getJob() == jobData[i][2] && jobData[i][4] == 1) {
            text += "#r#L" + i + "#" + jobData[i][0] + "\r\n";
            flag = true;
        }
    } else if (subjob == 2) {
        if (player.getJob() == jobData[i][2] && jobData[i][4] == 2) {
            text += "#r#L" + i + "#" + jobData[i][0] + "\r\n";
            flag = true;
        }
    } else {
        var subtype = null == jobData[i][4] ? 0 : jobData[i][4];
        if (player.getJob() == jobData[i][2] && subtype == subjob) {
            text += "#r#L" + i + "#" + jobData[i][0] + "\r\n";
            flag = true;
        }
    }
}
if (flag) {
    let sel = npc.askMenu(text, 9330576);
    let ret = npc.askMenu("#b您是否要轉職為:" + jobData[sel][0] + "\r\n\r\n\r\n#L1##g點我轉職#l", 9330576);
    if (ret == 1) {
        if (player.getLevel() < jobData[sel][3]) {
            npc.sayNext("對不起,您的等級不足" + jobData[sel][3] + "級。");
        } else {
            if (jobData[sel][3] == 200) {
                player.completeQuest(1465, 0);
                player.completeQuest(1484, 0);
                player.completeQuest(1466, 0);
                player.completeQuest(6500, 0);
                player.addPQLog("是否五轉", 1, 3000)
                npc.say("一鍵五轉成功!");
            } else {
                player.setJob(jobData[sel][1]);
                player.gainSp(3);
                player.gainItem(2431305, 1);
                player.maxSkills();
            }
        }
    } else {
        npc.sayNext("對不起,你現在不能轉職。");
    }
    //player.showHint("部分職業副手裝備不上的話\r\n萬能選單-新手中新-強裝副手\r\n可以進行卸載於強裝", 255, 10)
}
