var a30 = "#fEffect/CharacterEff/1022223/6/0#" //跑马灯
var a31 = "#fEffect/CharacterEff/1022223/7/0#" //跑马灯
var a32 = "#fEffect/CharacterEff/1022223/8/0#" //跑马灯
var a38 = "#fItem/Pet/5000213.img/stand0/0#";//藍色惡魔
var success = "#fUI/UIWindow3/Zero_Weapon/Success/8#"; //成功
var failed = "#fUI/UIWindow3/Zero_Weapon/Fail/8#"; //失敗
var XD0 = "#fEffect/CharacterEff/1051366/1/0#"; //

var Chance = Array(50, 30, 10, 5, 3);
var ItemList = Array(
    /* 稀有裝備 */
    1162009,//永生之石
    1113149, //銀花戒指
    1032241, //戴雅希杜斯耳環
    1022277, //拉圖斯標誌
    1022231, //水中信紙
    1012478, //凝聚的力量結晶石
    1122076, //混沌暗黑龍王的項鍊
    1182087, //水晶溫杜斯胸章
    1152170, //皇家暗黑合金護肩
    1113020, //戰神祝福
    1022232,//黑豆
    1152155,
    1942004,
    1092088,
    1952004,
    1182017,
    1962004,
    1092088,
    1113316,
    1012757,
    1122443,
    1032330,
    1972004,
    1032216,
    1113070,
    1342090,
    1113187,
    1092089,
    1672077,
    1112792,
    1032136,//地獄火
    1113282,//高貴的伊
    1113313,//守護者天
    1122000,//黑龍項鏈
    1122254,//梅克奈
    1122150,//支配著
    1132272,//金花草
    1132296,//憤怒的
    1162025,//粉紅
    1342095,
    1672079,
    1182016, //VIP休菲凱曼黃金胸章道具
    1032219,
    /* 滅龍系列 */
    1052721, //上級鬥劍士盔甲
    1052723, //滅龍騎士盔甲
    //通用強化道具
    1113149, //銀花戒指
    1032241, //戴雅希杜斯耳環
    1182158,//黑翼
    1052723,//滅龍
    1182136,//mx
    1113083,//骷髏
    1122296,//死神
    1190544,//覺醒
    1113195,
    1113196,
    1022277, //拉圖斯標誌
    1022231, //水中信紙
    1012478, //凝聚的力量結晶石
    1122076, //混沌暗黑龍王的項鍊
    1132272,
    1113089,
    1032227,
    1122274,
    1122150,
    1112597, //西格諾斯的克希努爾
    1112952, //希拉的憤怒
    1032136,
    1162009,
    1113020, //戰神祝福
    1112951,
    1182087, //水晶溫杜斯胸章
    1152170, //皇家暗黑合金護肩
    1082489,//高級次元手套
    1112956,//新星戒指
    /* 培羅德系列 */
    1032222, //高級培羅德耳環
    1122266, //高級培羅德烙印墜飾
    1132245, //高級培羅德烙印腰帶
    1113073, //中級培羅德戒指
    1113074, //高級培羅德戒指
    1032223, //頂級培羅德耳環
    1122267, //頂級培羅德烙印墜飾
    1132246, //頂級培羅德烙印腰帶
    1113075, //頂級培羅德戒指

    /* 漆黑飾品 */
    1012632, //口紅控制器標誌
    1022278, //附有魔力的眼罩
    1113306, //巨大的恐怖
    1122430, //苦痛的根源
    1132308, //夢幻的腰帶
    1032316, //指揮官力量耳環
    1122296, //死神的項鍊


    /* 戒指 */
    1113196, //強力的魔性戒指
    1113211, //天上的氣息

    /* 心臟 */
    1672069, //女武神之心
    1672075, //M-DAY機器心臟
    1672073,

    /* 神秘冥界幽靈武器 */
    1213018, //神秘冥界幽靈調節器
    1232113, //神秘冥界幽靈魔劍
    1302343, //神秘冥界幽靈長劍
    1312203, //神秘冥界幽靈之斧
    1322255, //神秘冥界幽靈之錘
    1402259, //神秘冥界幽靈雙手劍
    1412181, //神秘冥界幽靈雙手斧
    1422189, //神秘冥界幽靈雙手錘
    1432218, //神秘冥界幽靈之槍
    1442274, //神秘冥界幽靈之矛
    1542117, //神秘冥界幽靈刀
    1212120, //神秘冥界幽靈閃耀之杖
    1252098, //神秘冥界幽靈幻獸棒
    1262039, //神秘冥界幽靈ESP限制者
    1282017, //神秘冥界幽靈魔法護腕
    1372228, //神秘冥界幽靈短杖
    1382265, //神秘冥界幽靈長杖
    1552119, //神秘冥界幽靈扇子
    1452257, //神秘冥界幽靈之弓
    1462243, //神秘冥界幽靈十字弓
    1522143, //神秘冥界幽靈雙弩槍
    1592020, //神秘冥界幽靈古代之弓
    1242122, //神秘冥界幽靈能量劍
    1272017, //神秘冥界幽靈鎖鏈
    1292018, //神秘冥界幽靈仙扇
    1332279, //神秘冥界幽靈短刀
    1342104, //神秘冥界幽靈之刃
    1362140, //神秘冥界幽靈手杖
    1472265, //神秘冥界幽靈鬥拳
    1222113, //神秘冥界幽靈靈魂射手
    1242121, //神秘冥界幽靈能量劍
    1403018, //神秘冥界幽靈武拳
    1482221, //神秘冥界幽靈之爪
    1492235, //神秘冥界幽靈火槍
    1532150, //神秘冥界幽靈加農砲
    1214018, //神秘冥界幽靈龍息射手
    1582023, //神秘冥界幽靈重拳槍
    1562009, //神秘冥界琉
    1572009, //神秘冥界璃

    /* 神秘冥界幽靈防具 */
    1004808, //神秘冥界幽靈騎士帽
    1053063, //神秘冥界幽靈騎士套裝
    1073158, //神秘冥界幽靈騎士鞋子
    1082695, //神秘冥界幽靈騎士手套
    1102940, //神秘冥界幽靈騎士斗篷
    1152196, //神秘冥界幽靈騎士護肩
    1004809, //神秘冥界幽靈魔法帽
    1053064, //神秘冥界幽靈魔導士套裝
    1073159, //神秘冥界幽靈魔導士鞋子
    1082696, //神秘冥界幽靈魔導士手套
    1102941, //神秘冥界幽靈法師斗篷
    1152197, //神秘冥界幽靈法師護肩
    1004810, //神秘冥界幽靈弓手帽
    1053065, //神秘冥界幽靈弓手套裝
    1073160, //神秘冥界幽靈弓手鞋子
    1082697, //神秘冥界幽靈弓手手套
    1102942, //神秘冥界幽靈弓手斗篷
    1152198, //神秘冥界幽靈弓手護肩
    1004811, //神秘冥界幽靈小偷帽
    1053066, //神秘冥界幽靈小偷套裝
    1073161, //神秘冥界幽靈小偷鞋子
    1082698, //神秘冥界幽靈小偷手套
    1102943, //神秘冥界幽靈小偷斗篷
    1152199, //神秘冥界幽靈小偷護肩
    1004812, //神秘冥界幽靈海盜帽
    1053067, //神秘冥界幽靈海盜套裝
    1073162, //神秘冥界幽靈海盜鞋子
    1082699, //神秘冥界幽靈海盜手套
    1102944, //神秘冥界幽靈海盜斗篷
    1152200, //神秘冥界幽靈海盜護肩

    /* 航海師武器 */
    1582017, //航海師重拳槍
    1232109, //航海師死亡魔劍
    1402251, //航海師重劍
    1302333, //航海師軍刀
    1312199, //航海師雙刃斧
    1322250, //航海師十字錘
    1412177, //航海師戰斧
    1422184, //航海師戰錘
    1432214, //航海師穿刺槍
    1442268, //航海師戰戟
    1542108, //航海師太刀
    1213017, //航海師調節器
    1212115, //航海師閃耀之杖
    1372222, //航海師文字短杖
    1382259, //航海師文字長杖
    1552110, //航海師扇子
    1252093, //航海師幻獸棒
    1262017, //航海師ESP限制器
    1282016, //航海師魔法護腕
    1522138, //航海師雙弩槍
    1592019, //航海師古代之弓
    1452252, //航海師混合弓
    1462239, //航海師強弩
    1242116, //航海師能量劍
    1242120, //航海師能量劍
    1332274, //航海師短刀
    1342101, //航海師雙刀
    1362135, //航海師手杖
    1472261, //航海師復仇拳套
    1292017, //航海師仙扇
    1272016, //航海師鎖鏈
    1222109, //航海師靈魂射手
    1482216, //航海師指虎
    1492231, //航海師手槍
    1532144, //航海師加農火炮
    1403017, //航海師武拳
    1012438,
    1022211,




    /* 航海師防具 */
    1004422, //航海師劍士頭盔
    1052882, //航海師劍士套裝
    1073030, //航海師劍士鞋
    1082636, //航海師劍士手套
    1102775, //航海師劍士斗篷
    1152174, //航海師劍士護肩
    1004423, //航海師法師帽
    1052887, //航海師法師套裝
    1073032, //航海師法師鞋
    1082637, //航海師法師手套
    1102794, //航海師法師斗篷
    1152176, //航海師法師護肩
    1004424, //航海師弓箭手帽
    1052888, //航海師弓箭手套裝
    1073033, //航海師弓箭手鞋
    1082638, //航海師弓箭手手套
    1102795, //航海師弓箭手斗篷
    1152177, //航海師弓箭手護肩
    1004425, //航海師盜賊帽
    1052889, //航海師盜賊套裝
    1073034, //航海師盜賊鞋
    1082639, //航海師盜賊手套
    1102796, //航海師盜賊斗篷
    1152178, //航海師盜賊護肩
    1004426, //航海師海盜帽
    1052890, //航海師海盜套裝
    1073035, //航海師海盜鞋
    1082640, //航海師海盜手套
    1102797, //航海師海盜斗篷
    1152179, //航海師海盜護肩
    1214016,
    1214017,
    1214018,

    /* 夫尼爾武器 */
    1232057, //夫尼爾死亡霸劍
    1312153, //夫尼爾雙刃斧
    1322203, //夫尼爾哥帝爾斯之錘
    1302275, //夫尼爾長青劍
    1402196, //夫尼爾佩尼坦西亞重劍
    1412135, //夫尼爾戰鬥重斧
    1422140, //夫尼爾閃雷之錘
    1432167, //夫尼爾光翼之槍
    1442223, //夫尼爾月之長矛
    1582016, //夫尼爾重拳槍
    1542063, //夫尼爾太刀
    1213016, //夫尼爾調節器
    1212063, //夫尼爾魔法克魯
    1262016, //夫尼爾ESP限制器
    1372177, //夫尼爾魔之短杖
    1382208, //夫尼爾魔法長杖
    1252015, //夫尼爾北極星幻獸棒
    1552063, //夫尼爾扇子
    1282015, //夫尼爾魔法護腕
    1452205, //夫尼爾風之長弓
    1462193, //夫尼爾風之翼強弩
    1522094, //夫尼爾雙風之翼
    1592018, //夫尼爾古代之弓
    1242060, //夫尼爾光能量劍
    1242061, //夫尼爾光能量劍
    1332225, //夫尼爾大馬士革短刀
    1342082, //夫尼爾瞬棱雙刀
    1362090, //夫尼爾清澈手杖
    1472214, //夫尼爾風險拳套
    1292016, //夫尼爾仙扇
    1272015, //夫尼爾鎖鏈
    1222058, //夫尼爾天使射手
    1482168, //夫尼爾芬里爾爪
    1532098, //夫尼爾加農火炮
    1403016, //夫尼爾武拳

    /* 夫尼爾武器 */
    1003797, //高貴的戰士頭盔
    1042254, //鷹眼戰士鎧甲
    1062165, //黃蜘蛛戰士褲
    1003798, //高貴的敦威治帽
    1042255, //鷹眼敦威治長袍
    1062166, //黃蜘蛛敦威治褲
    1003799, //高貴的守護貝雷帽
    1042256, //鷹眼守護者頭巾
    1062167, //黃蜘蛛守護者褲
    1003800, //高貴的暗殺者頭套帽
    1042257, //鷹眼暗殺者T恤
    1062168, //黃蜘蛛暗殺者褲
    1003801, //高貴的漫遊者帽
    1042258, //鷹眼漫遊者大衣
    1062169, //黃蜘蛛漫遊者褲

    1062289, //无尽辉耀海盗裤
    1062288, //无尽辉耀飞侠裤
    1062287, //无尽辉耀弓箭手裤
    1062286, //无尽辉耀魔法师裤
    1062285, //无尽辉耀骑士裤
    1042437, //无尽辉耀海盗大衣
    1042436, //无尽辉耀飞侠衬衫
    1042435, //无尽辉耀弓箭手斗篷
    1042434, //无尽辉耀魔法师长袍
    1042433, //无尽辉耀骑士盔甲
    1005984, //无尽辉耀海盗帽
    1005983, //无尽辉耀飞侠头巾
    1005982, //无尽辉耀弓箭手帽
    1005981, //无尽辉耀魔法师帽
    1005980, //无尽辉耀骑士头
    //下面是解封的創世武器
    1582044,
    1572010,
    1562010,
    1552130,
    1542128,
    1532157,
    1522152,
    1492245,
    1482232,
    1472275,
    1462252,
    1452266,
    1442285,
    1432227,
    1422197,
    1412189,
    1403022,
    1402268,
    1382274,
    1372237,
    1362149,
    1332289,
    1322264,
    1312213,
    1302355,
    1292022,
    1282040,
    1272040,
    1262051,
    1252106,
    1242141,
    1242139,
    1232122,
    1222122,
    1213022,
    1212129,
    1592022,
    1214022
);

if (player.getInventorySlot(1, 1) == null) {
    var msg = "\r\n";
    msg += "\t#e#fs26##b【速敲白金鎚子系統】\r\n#n";
    msg += "" + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + "\r\n\r\n";
    msg += "  #r#e#fs20#玩家裝備欄位#fc0xFFF28500#第一格#r無裝備!\r\n";
    npc.askMenu(msg);

}

var itemID = player.getInventorySlot(1, 1).getDataId();
var dgms = 0;
for (var i = 0; i < ItemList.length; i++) {
    if (itemID == ItemList[i]) {
        dgms++;
    }
}

if (dgms == 0) {
    var sss = "\r\n";
    sss += "\t#e#fs26##b【速敲白金鎚子系統】\r\n\r\n#n";
    msg += "" + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + XD0 + "\r\n\r\n";
    sss += "#r#e#fs20#此格裝備並無開放速敲白鎚使用!\r\n      #fs18##fc0xFFffd700##d僅開放以下裝備使用↓\r\n";
    for (var i = 0; i < ItemList.length; i++) {
        sss += "#i" + ItemList[i] + "#";
    }
    npc.askMenu(sss);
}
var d1 = "#fUI/UIWindow2.img/Arbeit/25#"//速敲白槌
var msg = "#fs21##e#r這裡是速敲白槌\r\n";



msg += "#b每次消耗 #v2472000# #r#z2472000# #b1 個。\r\n\r\n";
msg += "擁有#r#z2472000# #b有 #r#c2472000# #b個。\r\n\r\n\r\n"; //#fc0xFFffd700#
msg += "\t\t\t\t#L0#[鍵盤Space快速白槌]#l\r\n\r\n";

//msg += "#fs14##fc0xFF4169E1##L1#查看開放道具【需添加私訊GM】#l";
let gg = npc.askMenuA(msg);

switch (gg) {
    case 0:
        var Equip = player.getInventorySlot(1, 1);
        if (player.hasItem(2472000, 1)) {
            if (Equip.getIUC2() <= 4) {
                var yes = Math.floor(Math.random() * 100);
                var psp = (Equip.getIUC2() + 1);
                if (yes < Chance[psp - 1]) {
                    Equip.setIUC2(Equip.getIUC2() + 1);
                    Equip.setRUC(Equip.getRUC() + 1);
                    player.updateItem(1, Equip);
                    var msg = "#r#L1#成功使用白金鎚子 #fc0xFFffd700#" + psp + " #r次！#l";
                } else {
                    var msg = "#fs20##b#L1#很可惜，使用白金鎚子失敗...#l";
                }
                player.loseItem(2472000, 1);
                npc.askMenu(msg);
                switch (gg) {
                    case 0:
                        player.runScript("速敲白鎚");
                }

            } else {
                npc.askMenu("\t\t #r#fs20#該裝備的白金鎚子次數已滿！");

            }
        } else {
            npc.askMenu("\t\t\t #e#r#fs24#白金鎚子數量不足！");

        }
        break;
    case 1:
        text = "#fs18##fc0xFFffd700##e#d僅開放以下裝備使用↓#l\r\n";
        for (var i in ItemList) {
            text += "#i" + ItemList[i] + ":#";
        }
        npc.askMenu(text);

    case 2:

        break;

}
